ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
<module name="MMCSD0_CTL_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_sdma_sys_addr_lo" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_sdma_sys_addr_lo" offset="0x0" width="16" description="
					This register contains the Lower 16-bit of physical system memory address used for DMA transfers or the second argument for the Auto CMD23 in Host version 3.0 and as 32-bit Block Count in Version 4.10.
					">
		<bitfield id="SDMA_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description=" 						When Host Version 4 Enable is set to 0 in the Host Control 2 register,DMA uses this register as system address in only 32-bit addressing mode. Auto CMD23 cannot be used with SDMA. When Host Version 4 Enable is set to 1, SDMA uses ADMA System Address register [05Fh-058h] instead of using this register to sup- port both 32-bit and 64-bit addressing. This register is re-assigned to 32-bit Block Count and then SDMA may use Auto CMD23.[1] SDMA System Address [Host Version 4 Enable = 0] This register contains the system memory address for a SDMA transfer in 32-bit addressing mode. When the Host Controller stops a SDMA transfer, this register shall point to the system address of the next contiguous data position. It can be accessed only if no transaction is executing [i.e., after a transaction has stopped]. Reading this register during SDMA transfers may return an invalid value. The Host Driver shall initialize this register before starting a SDMA transaction. After SDMA has stopped, the next system address of the next contiguous data posi- tion can be read from this register. The SDMA transfer waits at the every boundary specified by the SDMA Buffer Boundary in the Block Size register. The Host Controller generates DMA Interrupt to request the Host Driver to update this register. The Host Driver sets the next system address of the next data position to this register. When the most upper byte of this register [003h] is written, the Host Controller restarts the SDMA transfer. When restarting SDMA by setting Continue Request in the Block Gap Control register, the Host Controller shall start at the next contiguous address stored here in the SDMA System Address register. ADMA does not use this register. 						[2] 32-bit Block Count [Host Version 4 Enable = 1] 						Host Controller Version 4.10 re-defines this register as 32-bit Block Count [Refer to Section 1.15 for more details about block count extension]. In version 4.00, this register may be used as 32-bit block count only for Auto CMD23 to set the argument of the CMD23 while executing Auto CMD23. The Host Controller would decrement the block count of this register every block transfer and data transfer stops when the count reaches zero. This register should be accessed only when no transaction is executing. Reading this register during data transfers may return invalid value. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_sdma_sys_addr_hi" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_sdma_sys_addr_hi" offset="0x2" width="16" description="
					This register contains the Upper 16-bit of physical system memory address used for DMA transfers or the second argument for the Auto CMD23 in Host version 3.0 and as 32-bit Block Count in Version 4.10.
					">
		<bitfield id="SDMA_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="                                                 This register contains the Upper 16-bit of physical system memory address used for DMA transfers or the second argument for the Auto CMD23 in Host version 3.0 and as 32-bit Block Count in Version 4.10. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_block_size" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_block_size" offset="0x4" width="16" description="This register is used to configure the number of bytes in a data block">
		<bitfield id="SDMA_BUF_SIZE" width="3" begin="14" end="12" resetval="0x0" description=" 						To perform long DMA transfer, System Address register shall be updated at every system boundary during DMA transfer. These bits specify the size of contiguous buffer in the system memory. The DMA transfer shall wait at the every boundary specified by these fields and the HC generates the DMA Interrupt to request the HD to update the System Address register. These bits shall support when the DMA Support in the Capabilities register is set to 1 and this function is active when the DMA Enable in the Transfer Mode register is set to 1. 						" range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="XFER_BLK_SIZE" width="12" begin="11" end="0" resetval="0x0" description=" 						This  field specifies the block size for block data transfers for CMD17, CMD18, CMD24, CMD25 and CMD53. It can be accessed only if no transaction is executing [i.e after a transaction has stopped]. Read operations during transfer return an invalid value and write operations shall be ignored. 						" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_block_count" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_block_count" offset="0x6" width="16" description="This register is used to configure the number of data blocks">
		<bitfield id="XFER_BLK_CNT" width="16" begin="15" end="0" resetval="0x0" description=" 					Host Controller Version 4.10 extends block count to 32-bit [Refer to Section 1.15].Selection of either 16-bit Block Count register or 32-bit Block Count register is defined as follows: 					[1] If Host Version 4 Enable in the Host Control 2 register is set to 0 or 16-bit Block Count register is set to non-zero, 16-bit Block Count register is selected 					[2] If Host Version 4 Enable is set to 1 and 16-bit Block Count register is set to zero, 32-bit Block Count register is selected.Use of 16-bit/32-bit Block Count register is enabled when Block     Count Enable in the Transfer Mode register is set to 1 and is valid only for multiple block transfers. The Host Driver shall set this register to a value between 1 and the maximum block count.The Host Controller decrements the block     count after each block transfer and stops when the count reaches zero. Setting the block count to 0 results in no data blocks is transferred.This register should be accessed only when no transaction is executing                          [i.e., after transactions are stopped]. During data transfer,read operations on this register may return an invalid value and write operations are ignored. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_argument1_lo" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_argument1_lo" offset="0x8" width="16" description="This register contains Lower bits of SD Command Argument">
		<bitfield id="CMD_ARG1" width="16" begin="15" end="0" resetval="0x0" description=" 						The SD Command Argument is specified as bit23-8 of Command-Format. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
