ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_argument1_hi" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_argument1_hi" offset="0xA" width="16" description="This register contains higher bits of SD Command Argument">
		<bitfield id="CMD_ARG1" width="16" begin="15" end="0" resetval="0x0" description=" 						The SD Command Argument is specified as bit39-24 of Command-Format. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_transfer_mode" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_transfer_mode" offset="0xC" width="16" description="This register is used to control the operations of data transfers">
		<bitfield id="RESP_INTR_DIS" width="1" begin="8" end="8" resetval="0x0" description=" 					Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver. Only R1 or R5 can be checked. If Host Driver checks response error,sets this bit to 0 and waits Command Complete Interrupt and then checks the response register. If Host Controller checks response error, sets this bit to 1 and sets Response Error Check Enable to 1. Command Complete Interrupt is disabled by  this bit regardless of Command Complete Signal Enable. 						" range="8" rwaccess="R/W"/> 
		<bitfield id="RESP_ERR_CHK_ENA" width="1" begin="7" end="7" resetval="0x0" description=" 					Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver. Only R1 or R5 can be checked.If Host Driver checks response error, this bit is set to 0 and Response Interrupt Disable is set to 0.If Host Controller checks response error, sets this bit to 1 and sets Response Interrupt Disable to 1. Response Type R1 / R5 selects either R1 or R5 response type. If an error   is detected, Response Error Interrupt is generated in the Response Error Interrupt Status register. 						" range="7" rwaccess="R/W"/> 
		<bitfield id="RESP_TYPE" width="1" begin="6" end="6" resetval="0x0" description=" 						When response error check is enabled, this bit selects either R1 or R5 response types. Two types of response checks are supported:                                                 R1 for memory and R5 for SDIO.                                                   Error Statuses Checked in R1                                                  	.Bit31 OUT_OF_RANGE 							.Bit30 ADDRESS_ERROR 							.Bit29 BLOCK_LEN_ERROR 							.Bit26 WP_VIOLATION 							.Bit25 CARD_IS_LOCKED 							.Bit23 COM_CRC_ERROR 							.Bit21 CARD_ECC_FAILED 							.Bit20 CC_ERROR 							.Bit19 ERROR 							Response Flags Checked in R5 							.Bit07 COM_CRC_ERROR 							.Bit03 ERROR 							.Bit01 FUNCTION_NUMBER 							.Bit00 OUT_OF_RANGE 						" range="6" rwaccess="R/W"/> 
		<bitfield id="MULTI_BLK_SEL" width="1" begin="5" end="5" resetval="0x0" description=" 						This bit enables multiple block data transfers. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="DATA_XFER_DIR" width="1" begin="4" end="4" resetval="0x0" description=" 						This bit defines the direction of data transfers.  						" range="4" rwaccess="R/W"/> 
		<bitfield id="AUTO_CMD_ENA" width="2" begin="3" end="2" resetval="0x0" description=" 						There are three methods to stop Multiple-block read and write operation. 						[1] Auto CMD12 Enable: 						Multiple-block read and write commands for memory require CMD12 to stop the operation. When this field is set to 01b, the Host Controller issues CMD12 automatically when last block transfer is completed. Auto CMD12 error is indicated to the Auto CMD Error Status register. The Host Driver shall not set this bit if the command does not require CMD12. 						When Host Version 4 Enable =0, CMD12 is issued when 16-bit Block Count is expired. When Host Version 4 Enable =1, CMD12 is issued when 16-bit Block Count or 32-bit Block Count is expired. 						[2] Auto CMD23 Enable:                                                  When this bit field is set to 10b, the Host Controller issues a CMD23 automatically before issuing a command specified in the Command register. The Host Controller Version 3.00 and later shall support this function. The following conditions are required to use the Auto CMD23.  					 						The following conditions are required to use the Auto CMD23. 						 Auto CMD23 Supported [Host Controller Version is 3.00 or later]. 						 A memory card that supports CMD23 [SCR[33]=1]. 						 If DMA is used, it shall be ADMA. 						 Only when CMD18 or CMD25 is issued. 						 						Auto CMD23 can be used with or without ADMA. By writing the Command register, the Host Controller issues a CMD23 first and then issues a command specified by the Command Index in Com-mand register. If response errors of CMD23 are detected, the second command is not issued. A CMD23 error is indicated in the Auto CMD Error Status register.32-bit block count value for CMD23 is set to 32-bit Block Count [SDMA System Address] register. 						[3] Auto CMD Auto Select [Version 4.10] 						As CMD23 is optional for SD memory card except UHS 104 card, if card supports CMD23, Auto CMD 23 should be used instead of Auto CMD12. Host Controller Version 4.10 defines this Auto CMD Auto Select mode. Selection of Auto CMD depends on setting of CMD23 Enable in the Host Control 2 register which indicates whether card supports CMD23. If CMD23 Enable =1, Auto CMD23 is used and if CMD23 Enable =0, Auto CMD12 is used. In case of Version 4.10 or later, use of Auto CMD Auto Select is recommended rather than use of Auto CMD12 Enable or Auto CMD23 Enable. 						" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="BLK_CNT_ENA" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit is used to enable the Block count register, which is only relevant for multiple block transfers. When this bit is 0, the Block Count register is disabled, which is useful in executing an infinite transfer. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="DMA_ENA" width="1" begin="0" end="0" resetval="0x0" description="DMA can be enabled only if DMA Support bit in the Capabilities register is set. If this bit is set to 1, a DMA operation shall begin when the HD writes to the upper byte of Command register [00Fh]. 						" range="0" rwaccess="R/W"/>
	</register>
