ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_command" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_command" offset="0xE" width="16" description="This register is used to program the Command for host controller">
		<bitfield id="CMD_INDEX" width="6" begin="13" end="8" resetval="0x0" description=" 						This bit shall be set to the command number [CMD0-63, ACMD0-63]. 						" range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="CMD_TYPE" width="2" begin="7" end="6" resetval="0x0" description=" 						There are three types of special commands. Suspend, Resume andAbort. These bits shall bet set to 00b for all other commands.  						Suspend Command: If the Suspend command succeeds, the HC shall assume the SD Bus has been released and that it is possible to issue the next command which uses the DAT line. The HC shall de-assert Read Wait for read transactions and stop checking busy   for write transactions. The Interrupt cycle shall start, in 4-bit mode. If the Suspend command fails, the HC shall maintain its current state. and the HD shall restart the transfer by setting Continue Request in the Block Gap            Control Register. 						Resume Command: The HD re-starts the data transfer by restoring the registers in the range of 000-00Dh. The HC shall check for busy before starting write transfers.  						Abort Command: If this command is set when exe- cuting a read transfer, the HC shall stop reads to the buffer. If this command is set when executing a writetransfer, the HC shall stop driving the DAT line. After issuing the Abort command, the HD should issue a software reset. 						" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="DATA_PRESENT" width="1" begin="5" end="5" resetval="0x0" description=" 						This bit is set to 1 to indicate that data is present and shall be transferred using the DAT line. If is set to 0 for the following: 						1. Commands using only CMD line [ex. CMD52]. 						2. Commands with no data transferbut using busy signal on DAT[0]line [R1b or R5b ex. CMD38]. 						3. Resume Command. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="CMD_INDEX_CHK_ENA" width="1" begin="4" end="4" resetval="0x0" description=" 						If this bit is set to 1, the HC shall check the index field in the response to see if it has the same value as the command index. If it is not, it is reported as a Command Index Error. If this bit is set to 0, the Index field is not checked. 						" range="4" rwaccess="R/W"/> 
		<bitfield id="CMD_CRC_CHK_ENA" width="1" begin="3" end="3" resetval="0x0" description=" 						If this bit is set to 1, the HC shall check the CRC field in the response. If an error is detected, it is reported as a Command CRC Error. If this bit is set to 0, the CRC field is not checked. 						" range="3" rwaccess="R/W"/> 
		<bitfield id="SUB_CMD" width="1" begin="2" end="2" resetval="0x0" description="This bit is added from Version 4.10 to distinguish a main command or sub command [Refer to Section 1.17]. When issuing a main com-mand, this bit is set to 0 and when    issuing a sub command, this bit is set to 1. Setting of this bit is checked by Sub Command Status in the Present State register.Host Driver manages whether main or sub command. Host Controller does not refer to this bit to issue a       command. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="RESP_TYPE_SEL" width="2" begin="1" end="0" resetval="0x0" description=" 						Response Type Select.  						" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_response" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_response" offset="0x10" width="16" description="This register is used to store responses from SD Cards">
		<bitfield id="CMD_RESP" width="16" begin="15" end="0" resetval="0x0" description=" 						 R[] refers to a bit range within the response data as transmitted on the SD Bus, REP[] refers to a bit 						range within the Response register. 						" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_data_port" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_data_port" offset="0x20" width="32" description="This register is used to access internal buffer">
		<bitfield id="BUF_RD_DATA" width="32" begin="31" end="0" resetval="0x0" description=" 						 The Host Controller Buffer can be accessed through this 32-bit Data Port Register. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_presentstate" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_presentstate" offset="0x24" width="32" description="The Host Driver can get status of the Host Controller from this 32-bit read-only register">
		<bitfield id="UHS2_IF_DETECTION" width="1" begin="31" end="31" resetval="0x0" description="  					This status indicates whether a card supports UHS-II IF. This status is enabled by setting UHS-II Interface Enable to 1 in the Host Control 2 regis-ter. UHS-II interface initialization is activated by setting SD Clock Enable in the Clock Control reg-ister. Host Controller drives STB.L on D0 lanefrom EIDL state and waits for receiving STB.L on D1 lane. This bit is set to 1 if STB.L is detected on D1 lane. Host Controller shall compensate latency from setting SD Clock Enable to output STB.L on D0 lane when reading this status [Refer to Figure 3-35 about details of this method]. This bit may be read any time after setting SD Clock Enable for faster UHS-II IF detection but Host Driver shall check this status at least 200us period from set- ting SD Clock Enable until detecting UHS-II IF. After UHS-II IF is detected, this bit is cleared by when EIDL is detected on D0 lane, UHS-II Inter-face Enable is set to 0 or Host full reset is exe-cuted.  						'0' UHS-II IF is not detected 						'1' UHS-II IF is detected  						" range="31" rwaccess="R"/> 
		<bitfield id="UHS2_IF_LANE_SYNC" width="1" begin="30" end="30" resetval="0x0" description="  					This status indicates whether lane is synchronized in UHS-II mode. This status is enabled by setting UHS-II Interface Enable to 1 in the Host Control 2 register. On detecting UHS-II Interface      [D31=1], Host Controller provides SYN LSS on D0 lane and waits for receiving SYN LSS on D1 lane. If SYN LSS is detected on D1 lane, Host Controller pro-vides LIDL LSS on D0 lane and waits for receiving LIDL LSS on D1 lane. In case of Version 4.00, this bit indicates comple-tion of Device PHY Initialization by detecting LIDL LSS on D1 lane.From Version 4.10, Host Controller may imple-ment a specific PHY verification method and PHY Initialization Failure can be indicated by keeping this bit to 0 even LIDL LSS is detected on D1 lane.Host Driver detects PHY Initialization Failure by timeout.This bit is cleared by when D0 lane is set to EIDL,UHS-II Interface Enable is set to 0 or executes Host full reset.   						" range="30" rwaccess="R"/> 
		<bitfield id="UHS2_DORMANT" width="1" begin="29" end="29" resetval="0x0" description="  					This status indicates whether UHS-II Ianes enterDormant state. This function is enabled by setting UHS-II Interface Enable to 1 in the Host Control 2 register. On issuing GO_DORMAT_STATE com-mand, Go Dormant Command [111b]; is set to Command type in the UHS-II Command register.This command type acts as a trigger to enterlanes into dormant state. Host Controller provides STB.H and EIDL on D0 lane and waits for receiv-ing STB.H and EIDL on D1 lane. This bit is set to 1 after the time of T_DMT_ENTRY [750 RCLK cycle] or more from detecting EIDL on D1 lane. 						RCLK may be stopped in dormant state, by setting SD Clock Enable to 0 in the Clock Control register while In Dormant State bit is set to 1. On writingClock Control register with setting SD Clock Enable to 1, Host Controller wakes lanes to exit Dormant State and In Dormant State is set to 0. In case of the card enters Hibernate Mode [RCLK is stopped], Host Driver may turn off VDD1 by clearing SD Bus Power for VDD1 bit in   the Power Control register. Host Controller shall turn off VDD1 after stopping RCLK. This bit is cleared by when Host Controller drives STB.L on D0 lane, UHS-II Interface Enable is set to 0 or executesHost full reset. 						" range="29" rwaccess="R"/> 
		<bitfield id="SUB_COMMAND_STS" width="1" begin="28" end="28" resetval="0x0" description="  						The Command register and Response register are commonly used for main command and sub command. This status is used to distinguish which response error statuses, main command or sub 						command, indicated in the Error Interrupt Status register or in the UHS-II Error Interrupt Status register. Refer to Section 1.17 about details of response error statuses.  						Just before reading of this register, the Sub Command Flag of the Command register or the UHS-II Command register is copied to this status. This status is effective not 						only when Response Error interrupt is generated but also when data error interrupt is generated with Command Not Issued by Error [D27 of this register] or  						Auto CMD Error interrupt is generated with Command Not Issued by Error by Auto CMD12 in the Auto CMD Error Status register. 						1 - Sub Command Status 						0 - Main Command Status  						" range="28" rwaccess="R"/> 
		<bitfield id="CMD_NOT_ISS_BY_ERR" width="1" begin="27" end="27" resetval="0x0" description="  						Setting of this status indicates that a command cannot be issued due to an error except Auto CMD12 error. [Equivalent error status by Auto CMD12 error is defined as Command Not Issued 						By Auto CMD12 Error in the Auto CMD Error Status register.] This status is set to 1 when Host Controller cannot issue a command after setting Command register  						or UHS-II Command register.Refer to Section 3.10 about 2L-HD error case inUHS-II mode.Sub Command Status [D28] indicates which command is not issued [main or sub]. 						1 - Command cannot be issued 						0 - No error for issuing a command  						" range="27" rwaccess="R"/> 
		<bitfield id="SDIF_CMDIN" width="1" begin="24" end="24" resetval="0x1" description="  						This status is used to check DAT line level to recover from errors, and for debugging.  						" range="24" rwaccess="R"/> 
		<bitfield id="SDIF_DAT3IN" width="1" begin="23" end="23" resetval="0x1" description=" 						This status is used to check DAT line level to recover from errors, and for debugging. This is 						especially useful in detecting the busy signal level from DAT[3]. 						" range="23" rwaccess="R"/> 
		<bitfield id="SDIF_DAT2IN" width="1" begin="22" end="22" resetval="0x1" description=" 						This status is used to check DAT line level to recover from errors, and for debugging. This is 						especially useful in detecting the busy signal level from DAT[2]. 						" range="22" rwaccess="R"/> 
		<bitfield id="SDIF_DAT1IN" width="1" begin="21" end="21" resetval="0x1" description=" 						This status is used to check DAT line level to recover from errors, and for debugging. This is 						especially useful in detecting the busy signal level from DAT[1]. 						" range="21" rwaccess="R"/> 
		<bitfield id="SDIF_DAT0IN" width="1" begin="20" end="20" resetval="0x1" description=" 						This status is used to check DAT line level to recover from errors, and for debugging. This is 						especially useful in detecting the busy signal level from DAT[0]. 						" range="20" rwaccess="R"/> 
		<bitfield id="WRITE_PROTECT" width="1" begin="19" end="19" resetval="0x0" description="  						The Write Protect Switch is supported for memory and combo cards.This bit reflects the SDWP# pin. 						" range="19" rwaccess="R"/> 
		<bitfield id="CARD_DETECT" width="1" begin="18" end="18" resetval="0x0" description="  						This bit reflects the inverse value of the SDCD# pin. 						'0' No Card present [SDCD# = 1] 						'1' Card present [SDCD# = 0] 						" range="18" rwaccess="R"/> 
		<bitfield id="CARD_STATE_STABLE" width="1" begin="17" end="17" resetval="0x0" description="  						This bit is used for testing. If it is 0, the Card Detect Pin Level is not stable. If this bit is set to 1,it means the Card Detect Pin Level is stable. The Software Reset For All in the Software Reset Register shall not affect this bit.   							'0' Reset of Debouncing 							'1' No Card or Inserted 						" range="17" rwaccess="R"/> 
		<bitfield id="CARD_INSERTED" width="1" begin="16" end="16" resetval="0x0" description="  						This bit indicates whether a card has been inserted. Changing from 0 to 1 generates a Card Insertion interrupt in the Normal Interrupt Status register and changing from 1 to 0 generates a Card Removal Interrupt in the Normal Interrupt Status register. The Software Reset For All in the Software Reset register shall not affect this bit. If a Card is removed while its power is on and its clock is oscillating, the HC shall clear SD Bus Power in the Power Control register and SD Clock Enable in the Clock control register. In addition the HD should clear the HC by the Software Reset For All in Software register. The card detect is active regardless of the SD Bus Power. 						'0' Reset or Debouncing or No Card 						'1' Card Inserted  						" range="16" rwaccess="R"/> 
		<bitfield id="BUF_RD_ENA" width="1" begin="11" end="11" resetval="0x0" description="  						This status is used for non-DMA read transfers.This read only flag indicates that valid data exists in the host side buffer status. If this bit is 1, readable data exists in the buffer. A change of this bit from 1 to 0 occurs when all the block data is read from the buffer. A change of this bit from 0 to 1 occurs when all the block data is ready in the buffer and generates the Buffer Read Ready Interrupt. 						" range="11" rwaccess="R"/> 
		<bitfield id="BUF_WR_ENA" width="1" begin="10" end="10" resetval="0x0" description="  						This status is used for non-DMA write transfers.This read only flag indicates if space is available for write data. If this bit is 1, data can be written to the buffer. A change of this bit from 1 to 0 occurs when all the block data is written to the buffer. A change of this bit from 0 to 1 occurs when top of block data can be written to the buffer and generates the Buffer Write Ready Interrupt. 						" range="10" rwaccess="R"/> 
		<bitfield id="RD_XFER_ACTIVE" width="1" begin="9" end="9" resetval="0x0" description="  						This status is used for detecting completion of a read transfer.  						This bit is set to 1 for either of the following conditions: 						  After the end bit of the read command. 						  When writing a 1 to continue Request in the Block Gap Control register to restart a read transfer. 						This bit is cleared to 0 for either of the following conditions: 						  When the last data block as specified by block length is transferred to the system. 						  When all valid data blocks have been transferred to the system and no current block transfers are being sent as a result of the Stop At Block Gap Request set to 1. A transfer complete interrupt is generated when this bit changes to 0.  						'0' No valid data 						'1' Transferring data 						" range="9" rwaccess="R"/> 
		<bitfield id="WR_XFER_ACTIVE" width="1" begin="8" end="8" resetval="0x0" description="  						This status indicates a write transfer is active. If this bit is 0, it means no valid write data exists in the HC. 						This bit is set in either of the following cases: 						 After the end bit of the write command. 						 When writing a 1 to Continue Request in the Block Gap Control register to restart a write transfer.  						This bit is cleared in either of the following cases: 						 After getting the CRC status of the last data block as specified by the transfer count [Single  or Multiple] 						 After getting a CRC status of any block where data transmission is about to be stopped by a Stop At Block Gap Request. During a write transaction, a Block Gap Event interrupt is generated when this bit is changed to 0, as a result of the Stop At Block Gap Request being set. This status is useful for the HD in determining when to issue commands during write busy. 						" range="8" rwaccess="R"/> 
		<bitfield id="SDIF_DAT7IN" width="1" begin="7" end="7" resetval="0x0" description="  						This status is used to check DAT line level to recover from errors, and for debugging.  						" range="7" rwaccess="R"/> 
		<bitfield id="SDIF_DAT6IN" width="1" begin="6" end="6" resetval="0x0" description="  						This status is used to check DAT line level to recover from errors, and for debugging.  						" range="6" rwaccess="R"/> 
		<bitfield id="SDIF_DAT5IN" width="1" begin="5" end="5" resetval="0x0" description="  						This status is used to check DAT line level to recover from errors, and for debugging.  						" range="5" rwaccess="R"/> 
		<bitfield id="SDIF_DAT4IN" width="1" begin="4" end="4" resetval="0x0" description="  						This status is used to check DAT line level to recover from errors, and for debugging.  						" range="4" rwaccess="R"/> 
		<bitfield id="RETUNING_REQ" width="1" begin="3" end="3" resetval="0x0" description="  						Host Controller may request Host Driver to execute re-tuning sequence by setting this bit when the data window is shifted by temperature drift and a tuned sampling point does not have a good margin to receive correct data. This bit is cleared when a command is issued with setting Execute Tuning in the Host Control 2 register.  Changing of this bit from 0 to 1 generates Re-Tuning Event. Refer to Normal Interrupt registers for more detail. This bit isn't set to 1 if Sampling Clock Select in the Host Control 2 register is set to 0 [using fixed sampling clock]. 						" range="3" rwaccess="R"/> 
		<bitfield id="DATA_LINE_ACTIVE" width="1" begin="2" end="2" resetval="0x0" description="  						This bit indicates whether one of the DAT line on SD bus is in use. 						" range="2" rwaccess="R"/> 
		<bitfield id="INHIBIT_DAT" width="1" begin="1" end="1" resetval="0x0" description="  						This status bit is generated if either the DAT Line Active or the Read transfer Active is set to 1. If this bit is 0, it indicates the HC can issue the next SD command. Commands with busy signal belong to Command Inhibit [DAT] [ex. R1b, R5b type]. Changing from 1 to 0 generates a Transfer Complete interrupt in the Normal interrupt status register. Note: The SD Host Driver can save registers in the range of 000-00Dh for a suspend transaction after this bit has changed from 1 to 0.  						'0' Can issue command which uses the DAT line 						'1' Cannot issue command which uses the DATline 						" range="1" rwaccess="R"/> 
		<bitfield id="INHIBIT_CMD" width="1" begin="0" end="0" resetval="0x0" description="  									SD Mode If this bit is 0, it indicates the CMD line is not in use and the HC can issue a SD command using the CMD line. This bit is set immediately after the Command register [00Fh] is written. This bit is cleared when the command response is   received. Even if the Command Inhibit [DAT] is set to 1, Commands using only the CMD line can be issued if this bit is 0. Changing from 1 to 0 gener- ates a Command complete interrupt in the Normal Interrupt Status register. If the HC   cannot issuethe command because of a command conflict error or because of Command Not Issued By Auto CMD12 Error, this bit shall remain 1 and the Com- mand Complete is not set. Status issuing Auto CMD12 is not read from this bit. Auto CMD12 and Auto CMD23 consist of two responses. In this case, this bit is not cleared by the response of CMD12 or CMD23 but cleared by the response of a read/write command. Status issuing Auto CMD12 is not read from this bit. So if a command is issued during Auto CMD12 opera- tion, Host Controller shall manage to issue two commands: CMD12 and a command set by Com-mand register.  									UHS-II Mode This bit is 0 means that a command packet can be issued by the Host Controller. While this bit is set to 1, which means the Host Controller is not ready to issue a next command, Host Driver shall not write the registers from UHS-II BlockSize [Offset 080h] to the UHS-II Command [Offset 09Eh]. Changing from 1 to 0 generates a Command Complete Interrupt in the Normal Interrupt Status-register. 									 									1- Host Controller is not ready to issue a com-mand 									0 - Host Controller is ready to issue a command Version 4.10 adds a new control to prevent error statuses from overwriting by receipt of a next com-mand. This status keeps indicating 1 while any of response error statuses is set to 1 [as described in Section 1.17], Command Not Issued by Error in this register is set to 1 or Command Not Issued by Auto CMD12 Error in the Auto CMD Error Status register is set to 1. Software Reset For CMD Lineis used to clear the error statuses above and this status. 						" range="0" rwaccess="R"/>
	</register>
