ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_host_control1" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_host_control1" offset="0x28" width="8" description="This register is used to program DMA modes, LED Control, Data Transfer Width, High Speed Enable, Card detect test level and signal selection">
		<bitfield id="CD_SIG_SEL" width="1" begin="7" end="7" resetval="0x0" description=" 						This bit selects source for card detection. 						'0' SDCD# is selected [for normal use] 						'1' The card detect test level is selected 						" range="7" rwaccess="R/W"/> 
		<bitfield id="CD_TEST_LEVEL" width="1" begin="6" end="6" resetval="0x0" description=" 						This bit is enabled while the Card Detect Signal Selection is set to 1 and it indicates card inserted or not. Generates [card ins or card removal] interrupt when the normal int sts enable bit is set.  						'0' No Card 						'1' Card Inserted 						" range="6" rwaccess="R/W"/> 
		<bitfield id="EXT_DATA_WIDTH" width="1" begin="5" end="5" resetval="0x0" description=" 						This bit controls 8-bit bus width mode for embedded device. Support of this function is indicated in 8-bit Support for Embedded Device in the Capabilities register. If a device supports 8-bit bus mode, this bit may be set to 1. If this bit is 0, bus width is controlled by Data Transfer Width in the Host Control 1 register.This bit is not effective when multiple devices are installed on a bus slot [Slot Type is set to 10b in the Capabilities register]. In this case, each  device bus width is controlled by Bus Width Preset field in the Shared Bus register. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="DMA_SELECT" width="2" begin="4" end="3" resetval="0x0" description=" 						This field is used to select DMA type. The Host Driver shall check support of DMA modes by referring the Capabilities register. Selected DMA is enabled by DMA Enable of the Transfer Mode   register in SD mode and DMA Enable of UHS-II Transfer Mode register in UHS-II mode. [1] Up to Version 3.00 When Host Version 4 Enable is set to 0, setting of this field is compatible to Host Controller Version 3.00.SDMA is initiated by  writing to the Command register when this field is set to 00b and the SDMA System Address regis-ter [32-bit] is used. SDMA does not support 64-bit address-ing.ADMA2 is initiated by writing to the Command register when this field is set  to 10b or 11b. Lower 32-bit of the ADMA Sys-tem Address register is used when this field is set to 10b and 64-bit of the ADMA System Address register is used when this field is set to 11b. Support of 64-bit System Addressing is indicated by 64-bit System Address Support for V3 in the Capabilities register. 64-bit AMDA2 uses 96-bit Descriptor. 					00 - SDMA is selected 					01 - 32-bit Address ADMA1 is selected 					10 -32-bit Address ADMA2 is selected 					11 - 64-bit Address ADMA2 is selected [Optional] 					[2] Version 4.00 or later When Host Version 4 Enable is set to 1, setting of this field is changed as follows.                                                 SDMA is initiated by Host Driver writes to the Command reg-ister when this field is set to 00b.ADMA2 is initiated by Host Driver writes to the Command register when this field is set to 10b or 11b and by ADMA3 sets to the ADMA System Address register when this field is set to 11b. ADMA3 is initiated by Host Driver writes to the ADMA3 IDAddress register when this field is set to 11b. 					00 - SDMA is selected 					01 - Not Used [New assignment is not allowed] 					10 - ADMA2 is selected [AMDA3 is not supported or dis-abled] 					11 - ADMA2 or ADMA3 is selected 						Support of 64-bit DMA and 128-bit Descriptor is indicated by 64-bit System Address Support for V4 in the Capabilities register. If the support bit is set to 1, all supported DMAs [depends on Support, ADMA2 Support and ADMA3 Sup-port] shall support 64-bit addressing. 64-bit Addressing in the Host Controller 2 register selects either 32-bit or 64-bit system addressing of DMAs. 						" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="HIGH_SPEED_ENA" width="1" begin="2" end="2" resetval="0x0" description=" 						This bit is optional. Before setting this bit, the HD shall check the High Speed Support in the capabilities register. If this bit is set to 0 [default], the HC outputs CMD line and DAT    lines at the falling edge of the SD clock [up to 25 MHz/20MHz for MMC]. If this bit is set to 1, the HC outputs CMD line and DAT lines at the rising edge of the SD clock [up to 50 MHz for SD/52MHz for MMC]/ 208Mhz [for SD3.0] If Preset Value Enable in the Host Control 2 register is set to 1, Host Driver needs to reset SD Clock Enable before changing this field to avoid generating clock glitches. After setting this field, the Host Driver sets SD Clock Enable again. 						This bit is not effective in UHS-II mode. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="DATA_WIDTH" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit selects the data width of the HC. The HD shall select it to match the data width of the SD card. 						This bit is not effective in UHS-II mode. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="LED_CONTROL" width="1" begin="0" end="0" resetval="0x0" description=" 						This bit is used to caution the user not to remove the card while the SD card is being accessed. If the software is going to issue multiple SD commands, this bit can be set during all transactions. It is not necessary to change for each transaction. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_power_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_power_control" offset="0x29" width="8" description="This register is used to program the SD Bus power and voltage level">
		<bitfield id="UHS2_VOLTAGE" width="3" begin="7" end="5" resetval="0x0" description=" 						This field determines supply voltage range to VDD2. This field can be set to 101b if 1.8V VDD2 Support in the Capabilities register is set to 1.  						'000' VDD2 Not supported 						'001'- '011' Reserved 						'100' Reserved for 1.2V 						'101' 1.8V 						'110' Not Used 						'111' Not Used 						" range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="UHS2_POWER" width="1" begin="4" end="4" resetval="0x0" description=" 						Setting this bit enables providing VDD2. 						'0' Power Off 						'1' Power On 						" range="4" rwaccess="R/W"/> 
		<bitfield id="SD_BUS_VOLTAGE" width="3" begin="3" end="1" resetval="0x0" description=" 						By setting these bits, the HD selects the voltage level for the SD card. Before setting this register, the HD shall check the voltage support bits in the capabilities register. If an unsupported voltage is selected, the Host System shall not supply SD bus voltage. 						 						'000'- '100' Reserved 						'101' 1.8V 						'110' 3.0V 						'111' 3.3V 						" range="3 - 1" rwaccess="R/W"/> 
		<bitfield id="SD_BUS_POWER" width="1" begin="0" end="0" resetval="0x0" description=" 						Before setting this bit, the SD host driver shall set SD Bus Voltage Select. If the HC detects the No Card State, this bit shall be cleared. 						If this bit is cleared, the Host Control-ler should immediately stop driving CMD and DAT[3:0] [tri-state], and drive SDCLK to low level [Refer to Section 2.2.14]. If card is connectedto    Host Controller, Host Controller shall set these lines to low before stopping to supply VDD1.In UHS-II mode, before clearing this bit, Host Driver shall clear SD Clock Enable and before stopping to sup-ply VDD1, Host Controller shall set DAT[2] to low if DAT[2] is used as out-of band interrupt. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_block_gap_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_block_gap_control" offset="0x2A" width="8" description="This register is used to program the block gap request, read wait control and interrupt at block gap">
		<bitfield id="BOOT_ACK_ENA" width="1" begin="7" end="7" resetval="0x1" description=" 						To check for the boot acknowledge in boot operation. 						" range="7" rwaccess="R/W"/> 
		<bitfield id="ALT_BOOT_MODE" width="1" begin="6" end="6" resetval="0x0" description=" 						To start boot code access in alternative mode. 						" range="6" rwaccess="R/W"/> 
		<bitfield id="BOOT_ENABLE" width="1" begin="5" end="5" resetval="0x0" description=" 						To start boot code access.   						" range="5" rwaccess="R/W"/> 
		<bitfield id="SPI_MODE" width="1" begin="4" end="4" resetval="0x0" description=" 						SPI mode enable bit.  						" range="4" rwaccess="R/W"/> 
		<bitfield id="INTRPT_AT_BLK_GAP" width="1" begin="3" end="3" resetval="0x0" description=" 						This bit is valid only in 4-bit mode of the SDIO card and selects a sample point in the interrupt cycle. Setting to 1 enables interrupt detection at the block gap for a multiple block transfer. If the SD card cannot signal an interrupt during a multiple block transfer, this bit should be set to 0. When the HD detects an SD card insertion, it shall set this bit according to the CCCR of the SDIO card. 						" range="3" rwaccess="R/W"/> 
		<bitfield id="RDWAIT_CTRL" width="1" begin="2" end="2" resetval="0x0" description=" 						The read wait function is optional for SDIO cards. If the card supports read wait, set this bit to enable use of the read wait protocol to stop read data using DAT[2] line. Otherwise the HC has to stop the SD clock to hold read data, which restricts commands generation. When the HD detects an SD card insertion, it shall set this bit according to the CCCR of the SDIO card. If the card does not support read wait, this bit shall never be set to 1 otherwise DAT line conflict may occur. If this bit is set to 0, Suspend / Resume cannot be supported. 						In UHS-II mode, Read Wait is disabled and DAT[2] line is used for Interrupt Signal from UHS-II Card.  						" range="2" rwaccess="R/W"/> 
		<bitfield id="CONTINUE" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit is used to restart a transaction which was stopped using the Stop At Block Gap Request. To cancel stop at the block gap, set Stop At block Gap Request to 0 and set this bit to restart the transfer. The Host Controller automatically clears this bit when the transaction re-starts. If Stop At Block Gap Request is set to 1, any write to this bit is ignored. In SD mode, this bit is cleared in either of the following cases:  [1] In the case of a read transaction, the DAT Line Active changes from 0 to 1 as a read transaction restarts. [2] In the case of a write transaction, the Write transfer active changes from 0 to 1 as the write transaction restarts. Therefore it is not necessary for Host driver to set this bit to 0. If Stop At Block Gap Request is set to 1, any write to this bit is ignored. 						'0'  Ignore 						'1' Restart 						" range="1" rwaccess="R/W"/> 
		<bitfield id="STOP_AT_BLK_GAP" width="1" begin="0" end="0" resetval="0x0" description=" 						This bit is used to stop executing a transaction at the next block gap for non- DMA,SDMA and ADMA transfers. Until the transfer complete is set to 1, indicating a transfer completion the HD shall leave this bit set to 1. Clearing both the Stop At Block Gap Request and Continue Request shall not cause the transaction to restart. Read Wait is used to stop the read transaction at the block gap. The HC shall honour Stop At Block Gap Request for write transfers, but for read transfers it requires that the SD card support Read Wait. Therefore the HD shall not set this bit during read transfers unless the SD card supports Read Wait and has set Read Wait Control to 1. In case of write transfers in which the HD writes data to the Buffer Data Port register, the HD shall set this bit after all block data is written. If this bit is set to 1, the HD shall not write data to Buffer data port register. This bit affects Read Transfer Active, Write Transfer Active, DAT line active and Command Inhibit [DAT] in the Present State register. 						In case of UHS-II, a transaction can be stopped at the boundary of DATA Burst [Flow Control basis]. Host Control-ler waits for sending Flow Control MSG until Continue Request is set to 1.  						'0' Transfer 						'1' Stop 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_wakeup_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_wakeup_control" offset="0x2B" width="8" description="This register is used to program the wakeup functionality">
		<bitfield id="CARD_REMOVAL" width="1" begin="2" end="2" resetval="0x0" description=" 						This bit enables wakeup event via Card removal assertion in the Normal Interrupt Status register.FN_WUS [Wake up Support] in CIS does not affect this bit. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="CARD_INSERTION" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit enables wakeup event via Card Insertion assertion in the Normal Interrupt Status register.FN_WUS [Wake up Support] in CIS does not affect this bit. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="CARD_INTERRUPT" width="1" begin="0" end="0" resetval="0x0" description=" 						This bit enables wakeup event via Card Interrupt assertion in the Normal Interrupt Status register.This bit can be set to 1 if FN_WUS [Wake Up Support] in CIS is set to 1. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_clock_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_clock_control" offset="0x2C" width="16" description="This register is used to program the Clock frequency select, generator select, Clock enable, Internal Clock state fields
					This register controls SDCLK in SD Mode and RCLK in UHS-II mode.
					">
		<bitfield id="SDCLK_FRQSEL" width="8" begin="15" end="8" resetval="0x0" description=" 						This register is used to select the frequency of the SDCLK pin. The frequency is not programmed directly; rather this register holds the divisor of the Base Clock Frequency For SD clock in the capabilities register. Only the following settings are allowed. 						[1] 8-bit Divided Clock Mode 							80h - base clock divided by 256 							40h - base clock divided by 128 							20h - base clock divided by 64 							10h - base clock divided by 32 							08h - base clock divided by 16 							04h - base clock divided by 8 							02h - base clock divided by 4 							01h - base clock divided by 2 							00h - base clock[10MHz-63MHz] Setting 00h specifies the highest frequency of the SD Clock. When setting multiple bits, the most significant bit is used as the divisor. But multiple bits should not be set. The two default divider values can be calculated by the frequency that is defined by the Base Clock Frequency For SD Clock in the Capabilities register. 							[1] 25 MHz divider value. 							[2] 400 KHz divider value. The frequency of the SDCLK is set by the following formula: Clock Frequency = [Baseclock] / divisor. Thus choose the smallest possible divisor which results in a clock frequency that is less than or equal to the target frequency. Maximum Frequency for SD = 50Mhz [base clock] Maximum Frequency for MMC = 52Mhz [base clock] Minimum Frequency = 195.3125Khz [50Mhz / 256], same calculation for MMC also.  						[2] 10-bit Divided Clock Mode Host Controller Version 3.00 supports this mandatory mode instead of the 8-bit Divided Clock Mode. The length of divider is extended to10 bits and all divider values shall be supported. 							3FFh --1/2046 Divided Clock 							N -------1/2N Divided Clock [Duty 50%] 							002h -- 1/4 Divided Clock 							001h ---1/2 Divided Clock 							000h --- Base Clock [10MHz-254MHz] 						" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="SDCLK_FRQSEL_UPBITS" width="2" begin="7" end="6" resetval="0x0" description=" 						Bit 07-06 is assigned to bit 09-08 of clock divider in SDCLK Frequency Select.  						" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CLKGEN_SEL" width="1" begin="5" end="5" resetval="0x0" description=" 						This bit is used to select the clock generator mode in SDCLK Frequency Select. If the Programmable Clock Mode is supported [non-zero value is set to Clock Multiplier in the Capabilities register], this bit attribute is RW, and if not supported, this bit attribute is RO and zero is read. This bit depends on the setting of Preset Value Enable in the Host Control 2 register. If the Preset Value Enable = 0, this bit is set by Host Driver. If the Preset Value Enable = 1, this bit is automatically set to a value specified in one of Preset Value registers. 						'0' Divided Clock Mode 						'1' Programmable Clock Mode 						" range="5" rwaccess="R/W"/> 
		<bitfield id="PLL_ENA" width="1" begin="3" end="3" resetval="0x0" description="This bit is added from Version 4.10 for Host Controller using PLL. This feature allows Host Controller to initialize clock generator in two steps: by Internal Clock Enable and PLL Enable and to minimize output latency [ex. SDCLK/RCLK, D0lane] from SD Clock Enable. There are two modes to keep Host Drivers compatibility. In both modes, PLL Locked timing is indicated by Internal Clock Stable. 								[1] When Host Version 4 Enable =0 [Host Driver Version 3, which does not support this bit] or this bit is not implemented,Internal Clock Enable [or SD Clock Enable] may     activate PLL [exit low power mode and start locking clock]. 								[2] When Host Version 4 Enable =1 [Host Driver Version 4],Internal Clock Enable is set before setting this bit and then setting this bit may activate PLL [exit low power    mode and start locking clock]. 						" range="3" rwaccess="R/W"/> 
		<bitfield id="SD_CLK_ENA" width="1" begin="2" end="2" resetval="0x0" description=" 						The HC shall stop SDCLK when writing this bit to 0. SDCLK frequency Select can be changed when this bit is 0. Then, the HC shall maintain the same clock frequency until SDCLK is stopped [Stop at SDCLK = 0]. If the HC detects the No Card state, this bit shall be cleared. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="INT_CLK_STABLE" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit is set to 1 when SD clock is stable after writing to Internal Clock Enable in this register to 1. The SD Host Driver shall wait to set SD Clock Enable until this bit is set to 1.  Note: This is useful when using PLL for a clock oscillator that requires setup time. 						" range="1" rwaccess="R"/> 
		<bitfield id="INT_CLK_ENA" width="1" begin="0" end="0" resetval="0x0" description=" 						This bit is set to 0 when the HD is not using the HC or the HC awaits a wakeup event. The HC should stop its internal clock to go very low power state. Still, registers shall be able to be read and written. Clock starts to oscillate when this bit is set to 1. When clock oscillation is stable, the HC shall set Internal Clock Stable in this register to 1. This bit shall not affect card detection. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_timeout_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_timeout_control" offset="0x2E" width="8" description="The register sets the Data Timeout counter value">
		<bitfield id="COUNTER_VALUE" width="4" begin="3" end="0" resetval="0x0" description=" 						This value determines the interval by which DAT line time-outs are detected. Refer to the Data Time-out Error in the Error Interrupt Status register for information on factors that dictate time-out generation. Time-out clock frequency will be generated by dividing the sdclockTMCLK by this value. When setting this register, prevent inadvertent time-out events by clearing the Data Time-out Error Status Enable [in the Error Interrupt Status Enable register]. 						1111 - Reserved 						1110 - TMCLK * 2^27 						-------------------- 						-------------------- 						0001 - TMCLK * 2^14 						0000 - TMCLK * 2^13 						" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_software_reset" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_software_reset" offset="0x2F" width="8" description="This register is used to program the software reset for data, command and for all">
		<bitfield id="SWRST_FOR_DAT" width="1" begin="2" end="2" resetval="0x0" description=" 						Only part of data circuit is reset. The following registers and bits are cleared by this bit: 						Buffer Data Port Register: Buffer is cleared and Initialized.  						Present State register: 						Buffer read Enable, 						Buffer write Enable, 						Read Transfer Active, 						Write Transfer Active, 						DAT Line Active, 						Command Inhibit [DAT].  						Block Gap Control register: 						Continue Request, 						Stop At Block Gap Request.  						Normal Interrupt Status register: 						Buffer Read Ready, 						Buffer Write Ready, 						Block Gap Event, 						Transfer Complete.  						" range="2" rwaccess="R/W"/> 
		<bitfield id="SWRST_FOR_CMD" width="1" begin="1" end="1" resetval="0x0" description=" 					Software Reset For CMD Line Only part of command circuit is reset to be able to issue a command. From Version 4.10, this bit is also used to initialize UHS-II command circuit. This reset is effective only command issuing circuit [including response error statuses related to Com-mand Inhibit [CMD] control] and does not affect data transfer circuit. Host Controller can continue data transfer even this reset is executed during handling of sub com- mand response errors. The following registers and bits are cleared by this bit: Present State register Command Inhibit [CMD] Normal Interrupt Status register Command Complete Error Interrupt Status [from Version 4.10] Response error statuses related to Com-mand Inhibit [CMD] 						" range="1" rwaccess="R/W"/> 
		<bitfield id="SWRST_FOR_ALL" width="1" begin="0" end="0" resetval="0x0" description=" 						This reset affects the entire HC except for the card detection circuit. Register bits of type ROC, RW, RW1C, RWAC are cleared to 0. During its initialization, the HD shall set this bit to 1 to reset the HC. The HC shall reset this bit to 0 when capabilities registers are valid and the HD can read them. Additional use of Software Reset For All may not affect the value of the Capabilities registers. If this bit is set to 1, the SD card shall reset itself and must be re initialized by the HD. 						" range="0" rwaccess="R/W"/>
	</register>
