ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sts" offset="0x30" width="16" description="This register gives the status of all the interrupts">
		<bitfield id="ERROR_INTR" width="1" begin="15" end="15" resetval="0x0" description="  					        If any of the bits in the Error Interrupt Status Register are set, then this bit is set. Therefore the HD can test for an error by checking this bit first. 					        In UHS-II mode is enabled, if any of the bits in the UHS-II Error Interrupt Status register are set, this bit is also set.  						'0' No error 						'1' Error 						" range="15" rwaccess="R"/> 
		<bitfield id="BOOT_COMPLETE" width="1" begin="14" end="14" resetval="0x0" description="  						This status is set if the boot operation gets terminated. 						'0' Boot operation is not terminated 						'1' Boot operation is terminated 						" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="RCV_BOOT_ACK" width="1" begin="13" end="13" resetval="0x0" description="  						This status is set if the boot acknowledge is received from device. 						'0' Boot ack not recieved 						'1' Boot ack is recieved 						" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="RETUNING_EVENT" width="1" begin="12" end="12" resetval="0x0" description="  						This status is set if Re-Tuning Request in the Present State register changes from 0 to 1. Host Controller requests Host Driver to perform re-tuning for next data transfer. Current data transfer [not large block count] can be completed without re-tuning.In UHS-II mode, this bit is not effective  						'0' Re-tuning not required 						'1' Re-tuning should be performed 						" range="12" rwaccess="R"/> 
		<bitfield id="INTC" width="1" begin="11" end="11" resetval="0x0" description="  						This status is set if INT_C is enabled and INT_C# pin is in low level. Writing this bit to 1 does not clear this bit. It is cleared by resetting the INT_C interrupt factor. 						" range="11" rwaccess="R"/> 
		<bitfield id="INTB" width="1" begin="10" end="10" resetval="0x0" description="  						This status is set if INT_B is enabled and INT_B# pin is in low level. Writing this bit to 1 does not clear this bit. It is cleared by resetting the INT_B interrupt factor. 						" range="10" rwaccess="R"/> 
		<bitfield id="INTA" width="1" begin="9" end="9" resetval="0x0" description="  						This status is set if INT_A is enabled and INT_A# pin is in low level. Writing this bit to 1 does not clear this bit. It is cleared by resetting the INT_A interrupt factor. NOTE : INT_A, INT_B, and INT_C are to be implemented based on the Application Requirements. By default these are not implemented as there is no specific requirement from Customers. 						" range="9" rwaccess="R"/> 
		<bitfield id="CARD_INTR" width="1" begin="8" end="8" resetval="0x0" description="  					When this status has been set and the Host Driver needs to start this interrupt service, Card Interrupt Status Enable in the Normal Interrupt Status Enable register may be set to 0 in order to clear the card interrupt status latched in the Host Controller and to stop driv-ing the interrupt signal to the Host System.After completion of the card interrupt service [It should reset interrupt factors in the SD card and the interrupt signal may not be asserted],set Card Interrupt Status Enable to 1 and start sampling the interrupt signal again. 					Writing this bit to 1 does not clear this bit. It is cleared by resetting the SD card interrupt fac-tor. 								[1] DAT[1] Interrupt Input in SD Mode 					In 1-bit mode, the Host Controller shall detect the Card Interrupt without SD Clock to support wakeup. In 4-bit mode, the card interrupt sig-nal is sampled during the interrupt cycle, so there are some sample delays between the interrupt signal from the SD card and the inter-rupt to the Host System. Interrupt detected by DAT[1] is supported when there is a card per slot. In case of UHS-I mode, switching time of Interrupt Period is relaxed for 2 clock cycles. Then Host Controller needs to delay start of interrupt sampling at least 2 clocks and should sample interrupt while Interrupt Period is sta-ble. 								[2] DAT[2] Interrupt Input in UHS-II Mode 					When Card Inserted in the Present State reg-ister and SD Bus Power for VDD1 in the Power Control register are set to 1, Host Con-troller configures DAT[2] as Interrupt Input and enables pull-up of DAT[2]. DAT[2] interrupt is asynchronous to RCLK, low level sensitive and 3.3V signal level. DAT[2] interrupt is masked by setting Card Interrupt Status Enable to 0 in the Normal Interrupt register.When either Card Inserted or SD Bus Power for VDD1 is set to 0, Host Controller sets DAT[2] to low. Only point to point connection is allowed between Host and Card. 								[3] INT MSG in UHS-II Mode 					INT MSG is enabled by setting INT MSG Enable in the UHS-II Device Select register. DAT[2] and INT MSG interrupt sources are ORed and indicated to Card Interrupt. If any bit in the UHS-II Device Interrupt Status regis- ter is set to 1, INT MSG interrupt is generated. INT MSG interrupt is cleared by writing a cor-respondent bit to 1 in the UHS-II Device Inter-rupt Status register. Masking DAT[2] interrupt also disables INT MSG interupt due to Card Interrupt Status Enable is set to 0. SDIO Ver-sion 4.00 does not support INT MSG. 						'0' No Card Interrupt  						'1' Generate Card Interrupt 						" range="8" rwaccess="R"/> 
		<bitfield id="CARD_REM" width="1" begin="7" end="7" resetval="0x0" description="  						This status is set if the Card Inserted in the Present State register changes from 1 to 0. When the HD writes this bit to 1 to clear this status the status of the Card Inserted in the Present State register should be confirmed. Because the card detect may possibly be changed when the HD clear this bit an Interrupt event may not be generated. 						'0' Card State Stable or Debouncing 						'1' Card Removed 						" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="CARD_INS" width="1" begin="6" end="6" resetval="0x0" description="  						This status is set if the Card Inserted in the Present State register changes from 0 to 1.When the HD writes this bit to 1 to clear this status the status of the Card Inserted in the Present State register should be confirmed. Because the card detect may possibly be changed when the HD clear this bit an Interrupt event may not be generated.  						'0' Card State Stable or Debouncing 						'1' Card Inserted 						" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="BUF_RD_READY" width="1" begin="5" end="5" resetval="0x0" description="  						This status is set if the Buffer Read Enable changes from 0 to 1. 						Buffer Read Ready is set to 1 for every CMD19 execution in tuning procedure.In UHS-II mode, this bit is set at FC [Flow Control] unit basis. 								 '0' Not ready to read buffer,	 								 '1'  Ready to read buffer 						" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="BUF_WR_READY" width="1" begin="4" end="4" resetval="0x0" description="  						This status is set if the Buffer Write Enable changes from 0 to 1.In UHS-II mode, this bit is set at FC [Flow	Control] unit basis. 						 '0' Not ready to write to buffer, 						 '1' Ready to write to buffer 						" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="DMA_INTERRUPT" width="1" begin="3" end="3" resetval="0x0" description="  						This status is set if the HC detects the Host DMA Buffer Boundary in the Block Size regiser. 						'0' No DMA Interrupt 						'1' DMA Interrupt is generated 						" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="BLK_GAP_EVENT" width="1" begin="2" end="2" resetval="0x0" description="  						If the Stop At Block Gap Request in the BlockGap Control Register is set, this bit is set. 						Read Transaction: This bit is set at the falling edge of the DAT Line Active Status [When the transaction is stopped at SD Bus timing. The Read Wait must be supported inorder to use this function].  						Write Transaction: This bit is set at the falling edge of Write Transfer Active Status [After getting CRC status at SD Bus timing]. 						In UHS-II mode, this bit is set at FC [Flow Control] unit basis. 						'0' No Block Gap Event 						'1' Transaction stopped at Block Gap 						" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="XFER_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description="  						This bit is set when a read / write transaction is completed. 							SD Mode 						Read Transaction: This bit is set at the falling edge of Read Transfer Active Status. There are two cases in which the Interrupt is generated. The first is when a data transfer is completed as specified by data length [After the last data has been read to the Host Sys- tem]. The second is when data has stopped at the block gap and completed the data transfer by setting the Stop At Block Gap Request in the Block Gap Control Register [After valid data has been read to the Host System]. 						Write Transaction: This bit is set at the falling edge of the DAT Line Active Status. There are two cases in which the Interrupt is generated. The first is when the last data is written to the card as specified by data length and Busy signal is released. The second is when data transfers are stopped at the block gap by setting Stop At Block Gap Request in the Block Gap Control Register and data transfers completed. [After valid data is written to the SD card and the busy signal is released]. Note: Transfer Complete has higher priority than Data Time-out Error. If both bits are set to 1, the data transfer can be considered complete. Note: While performing tuning procedure [Execute Tuning is set to 1], Transfer Complete is not set to 1 						Command with Busy: This bit is set when busy is de-asserted. Refer to DAT Line Active and Command Inhibit[DAT] in the Present State register.UHS-I mode While performing tuning procedure [Execute Tuning is set to 1], Transfer Complete is not set to 1.   						'0' No Data Transfer Complete, 						'1' Data Transfer Complete  						UHS-II Mode 						This interrupt is generated in following twocases:  							[a] EBSY Completion [for EBSY supported commands] When EBSY Wait in the UHS-II Transfer Mode register is set to 1, this bit is set when EBSY packet has been received, and all valid data have been sent to system memory in case of read operation. 							[b] Stop and Continue during DCMD Data Transfer When Stop At Block Gap Request in the Block Gap Control register is set to 1 and data transfer is stopped at the Flow Control. 						Following is for both SD mode and UHS-II mode. The table below shows that Transfer Com-plete has higher priority than Data Timeout Error. If both bits are set to 1, execution of a command can be considered to be completed. 							1 - Command execution is completed 							0 - Not complete 						" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description="  							SD Mode 						This bit is set when we get the end bit of the command response [Except Auto CMD12 and Auto CMD23] Note: Command Time-out Error has higher priority than Command Complete. If both are set to 1, it can be considered that the response was not received correctly. Version 4.00 defines response check function for R1 and R5. If Response Interrupt Disable in the Transfer Mode register is set to 1, gen-eration of this interrupt is prohibited regardless of Command Complete Signal Enable. 							UHS-II Mode If Response Interrupt Disable is set to 0 in the UHS-II Transfer Mode register, this interrupt is generated when response packet is received.If Response Interrupt Disable is set to 1 in the UHS-II Transfer Mode register, generation of   this interrupt is prohibited regardless of Com-mand Complete Signal Enable. 						'0' No Command Complete, 						'1' Command Complete 						" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sts" offset="0x32" width="16" description="This register gives the status of the error interrupts">
		<bitfield id="HOST" width="1" begin="12" end="12" resetval="0x0" description="  						Occurs when detecting ERROR in m_hresp[dma transaction] 						" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="RESP" width="1" begin="11" end="11" resetval="0x0" description=" Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver during DMA execution. If Response Error Check Enable is set to 1 in the Transfer Mode register, Host Controller Checks R1 or R5 response. If an error is detected in a response, this bit is set to 1.If Response Error Check Enable is set to 1 in the Transfer Mode register, Host Controller Checks R1 or R5 response. 						" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="TUNING" width="1" begin="10" end="10" resetval="0x0" description="  This bit is set when an unrecoverable error is detected in a tuning circuit except during tuning procedure [Occurrence of an error during tuning procedure is indicated by Sampling Select]. By detecting Tuning Error, Host Driver needs to abort a command executing and perform tuning.To reset tuning circuit, Sampling Clock shall be set to 0 before executing tuning procedure. The Tuning Error is higher priority than the other error interrupts generated during data transfer. By detecting Turning Error, the Host Driver should discard data transferred by a current read/write command and retry data transfer after the Host Controller retrieved from tuning circuit error. 	    " range="10" rwaccess="R/W1TC"/> 
		<bitfield id="ADMA" width="1" begin="9" end="9" resetval="0x0" description="  						This bit is set when the Host Controller detects errors during ADMA based data transfer. The state of the ADMA at an error occurrence is saved in the ADMA Error Status Register. 						" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="AUTO_CMD" width="1" begin="8" end="8" resetval="0x0" description="   					         Auto CMD12 and Auto CMD23 use this error status.This bit is set when detecting that any of the bits D00 to D05 in Auto CMD Error Status register has changed from 0 to 1. D07 is effective in case of Auto CMD12. Auto CMD Error Status register is valid while this bit is set to 1 and may be cleared with clearing of this bit [another implementation is also allowed]. 						" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CURR_LIMIT" width="1" begin="7" end="7" resetval="0x0" description="  						By setting the SD Bus Power bit in the Power Control Register, the HC is requested to supply power for the SD Bus. If the HC supports the Current Limit Function, it can be protected from an Illegal card by stopping power supply to the card in which case this bit indicates a failure status. Reading 1 means the HC is not supplying power to SD card due to some failure. Reading 0 means that the HC is supplying power and no error has occurred. This bit shall always set to be 0, if the HC does not support this function. 						" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="DATA_ENDBIT" width="1" begin="6" end="6" resetval="0x0" description="  						Occurs when detecting 0 at the end bit position of read data which uses the DAT line or the end bit position of the CRC status. 						" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="DATA_CRC" width="1" begin="5" end="5" resetval="0x0" description="  						Occurs when detecting CRC error when transferring read data which uses the DAT line or when detecting the Write CRC Status having a value of other than 010. 						" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="DATA_TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="  						Occurs when detecting one of following timeout conditions: 						1. Busy Timeout for R1b, R5b type. 						2. Busy Timeout after Write CRC status 						3. Write CRC status Timeout 						4. Read Data Timeout.  						" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_INDEX" width="1" begin="3" end="3" resetval="0x0" description="  						Occurs if a Command Index error occurs in the Command Response. 						" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_ENDBIT" width="1" begin="2" end="2" resetval="0x0" description="  						Occurs when detecting that the end bit of a command response is 0. 						" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_CRC" width="1" begin="1" end="1" resetval="0x0" description="  						Command CRC Error is generated in two cases.  						1. If a response is returned and the Command Time-out Error is set to 0, this bit is set to 1 when detecting a CRT error in the command response 						2. The HC detects a CMD line conflict by monitoring the CMD line when a command is issued. If the HC drives the CMD line to 1 level, but detects 0 level on the CMD line at the next SDCLK edge, then the HC shall abort the command [Stop driving CMD line] and set this bit to 1. The Command Timeout Error shall also be set to 1 to distinguish CMD line conflict. 						" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="  						Occurs only if the no response is returned within 64 SDCLK cycles from the end bit of the command. If the HC detects a CMD line conflict, in which case Command CRC Error shall also be set. This bit shall be set without waiting for 64 SDCLK cycles because the command will be aborted by the HC. 						" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sts_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sts_ena" offset="0x34" width="16" description="This register is used to enable the normal interrupt status register fields">
		<bitfield id="BIT15_FIXED0" width="1" begin="15" end="15" resetval="0x0" description="  						The HC shall control error Interrupts using the Error Interrupt Status Enable register. 						" range="15" rwaccess="R"/> 
		<bitfield id="BOOT_COMPLETE" width="1" begin="14" end="14" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="14" rwaccess="R/W"/> 
		<bitfield id="RCV_BOOT_ACK" width="1" begin="13" end="13" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="13" rwaccess="R/W"/> 
		<bitfield id="RETUNING_EVENT" width="1" begin="12" end="12" resetval="0x0" description="  									0 - Masked 									1 - Enabled 						" range="12" rwaccess="R/W"/> 
		<bitfield id="INTC" width="1" begin="11" end="11" resetval="0x0" description="  						If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_C and may set this bit again after all interrupt requests to INT_C pin are cleared to prevent inadvertent interrupts. 						" range="11" rwaccess="R/W"/> 
		<bitfield id="INTB" width="1" begin="10" end="10" resetval="0x0" description="  						If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_B and may set this bit again after all interrupt requests to INT_B pin are cleared to prevent inadvertent interrupts. 						" range="10" rwaccess="R/W"/> 
		<bitfield id="INTA" width="1" begin="9" end="9" resetval="0x0" description="  						If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_A and may set this bit again after all interrupt requests to INT_A pin are cleared to prevent inadvertent interrupts. 						" range="9" rwaccess="R/W"/> 
		<bitfield id="CARD_INTERRUPT" width="1" begin="8" end="8" resetval="0x0" description="  						If this bit is set to 0, the HC shall clear Interrupt request to the System. The Card Interrupt	detection is stopped when this bit is cleared and restarted when this bit is set to 1. The HD may clear the Card Interrupt Status Enable before servicing the Card Interrupt and may set this bit again after all Interrupt requests from the card are cleared to prevent inadvertent Interrupts. 						By setting this bit to 0, interrupt input should be masked by implementation so that the interrupt Input is not affected by external signal in any state [ex. floating].  						" range="8" rwaccess="R/W"/> 
		<bitfield id="CARD_REMOVAL" width="1" begin="7" end="7" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="7" rwaccess="R/W"/> 
		<bitfield id="CARD_INSERTION" width="1" begin="6" end="6" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="6" rwaccess="R/W"/> 
		<bitfield id="BUF_RD_READY" width="1" begin="5" end="5" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="5" rwaccess="R/W"/> 
		<bitfield id="BUF_WR_READY" width="1" begin="4" end="4" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="4" rwaccess="R/W"/> 
		<bitfield id="DMA_INTERRUPT" width="1" begin="3" end="3" resetval="0x0" description="  						'0' Masked, 						'1' Enabled 						" range="3" rwaccess="R/W"/> 
		<bitfield id="BLK_GAP_EVENT" width="1" begin="2" end="2" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="2" rwaccess="R/W"/> 
		<bitfield id="XFER_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="1" rwaccess="R/W"/> 
		<bitfield id="CMD_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="0" rwaccess="R/W"/>
	</register>
