ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sts_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sts_ena" offset="0x36" width="16" description="This register is used to enable the Error Interrupt Status register fields">
		<bitfield id="VENDOR_SPECIFIC" width="2" begin="14" end="13" resetval="0x0" description="N/A" range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="HOST" width="1" begin="12" end="12" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="12" rwaccess="R/W"/> 
		<bitfield id="RESP" width="1" begin="11" end="11" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="11" rwaccess="R/W"/> 
		<bitfield id="TUNING" width="1" begin="10" end="10" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="10" rwaccess="R/W"/> 
		<bitfield id="ADMA" width="1" begin="9" end="9" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="9" rwaccess="R/W"/> 
		<bitfield id="AUTO_CMD" width="1" begin="8" end="8" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="8" rwaccess="R/W"/> 
		<bitfield id="CURR_LIMIT" width="1" begin="7" end="7" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="7" rwaccess="R/W"/> 
		<bitfield id="DATA_ENDBIT" width="1" begin="6" end="6" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="6" rwaccess="R/W"/> 
		<bitfield id="DATA_CRC" width="1" begin="5" end="5" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="5" rwaccess="R/W"/> 
		<bitfield id="DATA_TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="4" rwaccess="R/W"/> 
		<bitfield id="CMD_INDEX" width="1" begin="3" end="3" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="3" rwaccess="R/W"/> 
		<bitfield id="CMD_ENDBIT" width="1" begin="2" end="2" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="2" rwaccess="R/W"/> 
		<bitfield id="CMD_CRC" width="1" begin="1" end="1" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="1" rwaccess="R/W"/> 
		<bitfield id="CMD_TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sig_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_normal_intr_sig_ena" offset="0x38" width="16" description="This register is used to enable the Normal Interrupt Signal register">
		<bitfield id="BIT15_FIXED0" width="1" begin="15" end="15" resetval="0x0" description="  						The HD shall control error Interrupts using the Error Interrupt Signal Enable register. 						" range="15" rwaccess="R"/> 
		<bitfield id="BOOT_COMPLETE" width="1" begin="14" end="14" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="14" rwaccess="R/W"/> 
		<bitfield id="RCV_BOOT_ACK" width="1" begin="13" end="13" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="13" rwaccess="R/W"/> 
		<bitfield id="RETUNING_EVENT" width="1" begin="12" end="12" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="12" rwaccess="R/W"/> 
		<bitfield id="INTC" width="1" begin="11" end="11" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="11" rwaccess="R/W"/> 
		<bitfield id="INTB" width="1" begin="10" end="10" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="10" rwaccess="R/W"/> 
		<bitfield id="INTA" width="1" begin="9" end="9" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="9" rwaccess="R/W"/> 
		<bitfield id="CARD_INTERRUPT" width="1" begin="8" end="8" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="8" rwaccess="R/W"/> 
		<bitfield id="CARD_REMOVAL" width="1" begin="7" end="7" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="7" rwaccess="R/W"/> 
		<bitfield id="CARD_INSERTION" width="1" begin="6" end="6" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="6" rwaccess="R/W"/> 
		<bitfield id="BUF_RD_READY" width="1" begin="5" end="5" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="5" rwaccess="R/W"/> 
		<bitfield id="BUF_WR_READY" width="1" begin="4" end="4" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="4" rwaccess="R/W"/> 
		<bitfield id="DMA_INTERRUPT" width="1" begin="3" end="3" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="3" rwaccess="R/W"/> 
		<bitfield id="BLK_GAP_EVENT" width="1" begin="2" end="2" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="2" rwaccess="R/W"/> 
		<bitfield id="XFER_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="1" rwaccess="R/W"/> 
		<bitfield id="CMD_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sig_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_error_intr_sig_ena" offset="0x3A" width="16" description="This register is used to enable Error Interrupt Signal register">
		<bitfield id="VENDOR_SPECIFIC" width="2" begin="14" end="13" resetval="0x0" description="N/A" range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="HOST" width="1" begin="12" end="12" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="12" rwaccess="R/W"/> 
		<bitfield id="RESP" width="1" begin="11" end="11" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="11" rwaccess="R/W"/> 
		<bitfield id="TUNING" width="1" begin="10" end="10" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="10" rwaccess="R/W"/> 
		<bitfield id="ADMA" width="1" begin="9" end="9" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="9" rwaccess="R/W"/> 
		<bitfield id="AUTO_CMD" width="1" begin="8" end="8" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="8" rwaccess="R/W"/> 
		<bitfield id="CURR_LIMIT" width="1" begin="7" end="7" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="7" rwaccess="R/W"/> 
		<bitfield id="DATA_ENDBIT" width="1" begin="6" end="6" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="6" rwaccess="R/W"/> 
		<bitfield id="DATA_CRC" width="1" begin="5" end="5" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="5" rwaccess="R/W"/> 
		<bitfield id="DATA_TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="4" rwaccess="R/W"/> 
		<bitfield id="CMD_INDEX" width="1" begin="3" end="3" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="3" rwaccess="R/W"/> 
		<bitfield id="CMD_ENDBIT" width="1" begin="2" end="2" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="2" rwaccess="R/W"/> 
		<bitfield id="CMD_CRC" width="1" begin="1" end="1" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="1" rwaccess="R/W"/> 
		<bitfield id="CMD_TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="  						'0' Masked 						'1' Enabled 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_autocmd_err_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_autocmd_err_sts" offset="0x3C" width="16" description="
					This register is used to indicate CMD12 response error of Auto CMD12 and CMD23 response error of Auto CMD 23
					">
		<bitfield id="CMD_NOT_ISSUED" width="1" begin="7" end="7" resetval="0x0" description=" 						Setting this bit to 1 means CMD_wo_DAT is not executed due to an Auto CMD12 error [D04- D01] in this register. This bit is set to 0 when Auto CMD Error is generated by Auto CMD23. 						" range="7" rwaccess="R"/> 
		<bitfield id="RESP" width="1" begin="5" end="5" resetval="0x0" description=" 				     This bit is set when Response Error Check Enable in the Transfer Mode register is set to 1 and an error is detected in R1 response of either Auto CMD12 or Auto CMD23. This status should be ignored if any bit of D00 to D04 is set to 1. 						" range="5" rwaccess="R"/> 
		<bitfield id="INDEX" width="1" begin="4" end="4" resetval="0x0" description=" 						Occurs if the Command Index error occurs in response to a command. 						" range="4" rwaccess="R"/> 
		<bitfield id="ENDBIT" width="1" begin="3" end="3" resetval="0x0" description=" 						Occurs when detecting that the end bit of command response is 0. 						" range="3" rwaccess="R"/> 
		<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description=" 						Occurs when detecting a CRC error in the command response. 						" range="2" rwaccess="R"/> 
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description=" 						Occurs if the no response is returned within 64 SDCLK cycles from the end bit of the command.If this bit is set to 1, the other error status bits [D04 - D02] are meaningless.  						" range="1" rwaccess="R"/> 
		<bitfield id="ACMD12_NOT_EXEC" width="1" begin="0" end="0" resetval="0x0" description=" 						If memory multiple block data transfer is not started due to command error, this bit is not set because it is not necessary to issue Auto CMD12. Setting this bit to 1 means the HC cannot issue Auto CMD12 to stop memory multiple block transfer due to some error. If this bit is set to 1, other error status bits [D04 - D01] are meaningless. This bit is set to 0 when Auto CMD Error is generated by Auto CMD23  						" range="0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_host_control2" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_host_control2" offset="0x3E" width="16" description="This register is used to program UHS Select Mode,UHS Select Mode,Driver Strength Select,Execute Tuning,Sampling Clock Select,Asynchronous Interrupt Enable and Preset value enable
					">
		<bitfield id="PRESET_VALUE_ENA" width="1" begin="15" end="15" resetval="0x0" description=" 						Host Controller Version 3.00 supports this bit. As the operating SDCLK frequency and I/O driver strength depend on the Host System implementation, it is difficult to determine these parameters in the Standard Host Driver. When Preset Value Enable is set to automatic. This bit enables the functions defined in the Preset Value registers.  If this bit is set to 0, SDCLK Frequency Select, Clock Generator Select in the Clock Control register and Driver Strength Select in Host Control 2 register are set by Host Driver. If this bit is set to 1, SDCLK Frequency Select, Clock Generator Select in the Clock Control register and Driver Strength Select in Host Control 2 register are set by Host Controller as specified in the Preset Value registers. 						" range="15" rwaccess="R/W"/> 
		<bitfield id="ASYNCH_INTR_ENA" width="1" begin="14" end="14" resetval="0x0" description=" 						This bit can be set to 1 if a card support asynchronous interrupt and Asynchronous Interrupt Support is set to 1 in the Capabilities register. Asynchronous interrupt is effective when DAT[1] interrupt is used in 4-bit SD mode [and zero is set to Interrupt Pin Select in the Shared Bus Control register]. If this bit is set to 1, the Host Driver can stop the SDCLK during asynchronous interrupt period to save power. During this period, the Host Controller continues to deliver Card Interrupt to the host when it is asserted by the Card. 						" range="14" rwaccess="R/W"/> 
		<bitfield id="BIT64_ADDRESSING" width="1" begin="13" end="13" resetval="0x0" description=" 						This field is effective when Host Version 4.00 Enable is set to 1. 						Host Controller selects either of 32-bit or 64-bit addressing	modes to access system memory. Whether 32-bit or 64-bit is determined by OS installed in a host system. Host Driver sets this bit depends on addressing mode of installed OS. Refer to 64-bit System Address Support in the Capabilities register. . 						" range="13" rwaccess="R/W"/> 
		<bitfield id="HOST_VER40_ENA" width="1" begin="12" end="12" resetval="0x0" description=" 					This bit selects either Version 3.00 compatible mode or Ver4.mode. In Version 4.00, support of 64-bit System Addressing is modified. All DMAs support 64-bit System Addressing. UHS-II supported Host Driver shall enable this bit. In Version 4.10, supported 32-bit Block Count for all operations. Functions of following fields are modified. 								SDMA Address 									SDMA uses ADMA System Address register [05Fh-058h] instead of SDMA System Address register [Offset 003-000h] 								ADMA2 / ADMA3 Selection 									ADMA3 is selected by DMA Select in the Host Control 1 regis-ter. 								64bit ADMA Descriptor Size 									128bit descriptor is used instead of 96-bit descriptor when 64-bit Addressing is set to 1. 									Selection of 32-bit / 64-bit System Addressing 									Either 32-bit or 64-bit system addressing is selected by 64-bit	Addressing bit in this register instead of DMA Select in the Host Control 1 register. 								32-bit Block Count 									SDMA System Address register [003h-000h] is modified to 32-bit Block Count register. 						" range="12" rwaccess="R/W"/> 
		<bitfield id="CMD23_ENA" width="1" begin="11" end="11" resetval="0x0" description=" 						In memory card initialization, Host Driver Version 4.10 checks whether card supports CMD23 by checking a bit SCR[33]. If the card supports CMD23 [SCR[33]=1], this bit is set to 1. This bit is used to select Auto CMD23 or Auto CMD12 for ADMA3 datatransfer. Refer to Auto CMD Enable in the Transfer Mode regis-ter. 						" range="11" rwaccess="R/W"/> 
		<bitfield id="ADMA2_LEN_MODE" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit selects one of ADMA2 Length Modes either 16-bit or 26-bit. 						" range="10" rwaccess="R/W"/> 
		<bitfield id="DRIVER_STRENGTH2" width="1" begin="9" end="9" resetval="0x0" description=" 						This is the programmed Drive STrength output and Bit[2] of the sdhccore_drivestrength value. 						" range="9" rwaccess="R/W"/> 
		<bitfield id="UHS2_INTF_ENABLE" width="1" begin="8" end="8" resetval="0x0" description=" 					This bit is used to enable UHS-II Interface. Before trying to start UHS-II initialization, this bit shall be set to 1. Before trying to start SD mode initialization, this bit shall be set to 0. 					This bit is used to enable UHS-II IF Detection, Lane Synchroni-zation and In Dormant State in the Present State register, and to select clock source of either SD mode or UHS-II mode. 					Host Controller shall not leave unused SD 4-bit Interface lines [CLK, CMD and DAT[3:2]] floating in UHS-II mode by using pull-up or driving to low. When DAT[2] is used as interrupt input in UHS-II mode, DAT[2] of Host Controller is set to input and then DAT[2] of SDIO card is set to output to avoid conflict. 						'0' 4-bit SD Interface enabled 						'1' UHS-II Interface enabled 						" range="8" rwaccess="R/W"/> 
		<bitfield id="SAMPLING_CLK_SELECT" width="1" begin="7" end="7" resetval="0x0" description=" 						This bit is set by tuning procedure when Execute Tuning is cleared. Writing 1 to this bit is meaningless and ignored. Setting 1 means that tuning is completed successfully and setting 0 means that tuning is failed. Host Controller uses this bit to select sampling clock to receive CMD and DAT. This bit is cleared by writing 0. Change of this bit is not allowed while the Host Controller is receiving response or a read data block.  						" range="7" rwaccess="R/W"/> 
		<bitfield id="EXECUTE_TUNING" width="1" begin="6" end="6" resetval="0x0" description=" 						This bit is set to 1 to start tuning procedure and automatically cleared when tuning procedure is completed. The result of tuning is indicated to Sampling Clock Select. Tuning procedure is aborted by writing 0 for more detail about tuning procedure.  						'0' Not Tuned or Tuning Completed 						'1' Execute Tuning 						" range="6" rwaccess="R/W"/> 
		<bitfield id="DRIVER_STRENGTH1" width="2" begin="5" end="4" resetval="0x0" description=" 						Host Controller output driver in 1.8V signaling is selected by this bit. In 3.3V signaling, this field is not effective. This field can be set depends on Driver Type A, C and D support bits in the Capabilities register. This bit depends on setting of Preset Value Enable. If Preset Value Enable = 0, this field is set by Host Driver.  If Preset Value Enable = 1, this field is automatically set by a value specified in the one of Preset Value registers.  						" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="V1P8_SIGNAL_ENA" width="1" begin="3" end="3" resetval="0x0" description=" 						This bit controls voltage regulator for I/O cell. 3.3V is supplied to the card regardless of signaling voltage. Setting this bit from 0 to 1 starts changing signal voltage from 3.3V to 1.8V. 1.8V regulator output shall be stable within 5ms. Host Controller clears this bit if switching to 1.8V signaling fails.  Clearing this bit from 1 to 0 starts changing signal voltage from 1.8V to 3.3V. 3.3V regulator output shall be stable within 5ms. Host Driver can set this bit to 1 when Host Controller supports 1.8V signaling [One of support bits is set to 1: SDR50, SDR104 or DDR50 in the Capabilities register] and the card or device supports UHS-I. 						'0' 3.3V Signalling, '1' 1.8V Signalling  						" range="3" rwaccess="R/W"/> 
		<bitfield id="UHS_MODE_SELECT" width="3" begin="2" end="0" resetval="0x0" description=" 						This field is used to select one of UHS-I modes or UHS-II mode.In case of UHS-I mode, this field is effective when 1.8V Signal-ing Enable is set to 1. In case of UHS-II mode, 1.8V Signaling Enable shall be set to 0. Setting of this field is used to select one of preset values in UHS-I or UHS-II mode. 						If Preset Value Enable in the Host Control 2 register is set to 1,Host Controller sets SDCLK/RCLK Frequency Select, Clock Generator Select in the Clock Control register and Driver Strength Select according to Preset Value registers. In this case, one of preset value registers is selected by this field. Host Driver needs to reset SD Clock Enable before changing this field to avoid generating clock glitch. After setting this field, Host Driver sets SD Clock Enable again.  When SDR50, SDR104 or DDR50 is selected for SDIO card, interrupt detection at the block gap shall not be used. Read Wait timing is changed for these modes. Refer to the SDIO Specification Version 3.00 for more detail. 						  						" range="2 - 0" rwaccess="R/W"/>
	</register>
