ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_capabilities" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_capabilities" offset="0x40" width="64" description="
				This register provides the HD with information specific to the HC implementation. The HC may implement these values as fixed or loaded from flash memory during power on initializa-tion.
					">
		<bitfield id="HS400_SUPPORT" width="1" begin="63" end="63" resetval="0x1" description=" 						1 HS400 is Supported 						0 HS400 is Not Supported 						" range="63" rwaccess="R"/> 
		<bitfield id="VDD2_1P8_SUPPORT" width="1" begin="60" end="60" resetval="0x1" description=" 						This field indicates that support of VDD2 on Host system. 						" range="60" rwaccess="R"/> 
		<bitfield id="ADMA3_SUPPORT" width="1" begin="59" end="59" resetval="0x1" description=" 						This field indicates that support of ADMA3 on Host Controller. 						" range="59" rwaccess="R"/> 
		<bitfield id="SPI_BLK_MODE" width="1" begin="57" end="57" resetval="0x0" description=" 						This field indicates whether SPI Block Mode is supported or not. 						" range="57" rwaccess="R"/> 
		<bitfield id="SPI_SUPPORT" width="1" begin="56" end="56" resetval="0x0" description=" 						This field indicates whether SPI Mode is supported or not. 						" range="56" rwaccess="R"/> 
		<bitfield id="CLOCK_MULTIPLIER" width="8" begin="55" end="48" resetval="0x0" description=" 						This field indicates clock multiplier value of programmable clock generator. Refer to Clock Control register. Setting 00h means that Host Controller does not support programmable clock generator. 						'FF' Clock Multiplier M = 256 						 --------- 						'02' Clock Multiplier M = 3 						'01' Clock Multiplier M = 2 						'00' Clock Multiplier is Not Supported. 						" range="55 - 48" rwaccess="R"/> 
		<bitfield id="RETUNING_MODES" width="2" begin="47" end="46" resetval="0x0" description=" 						This field defines the re-tuning capability of a Host Controller and how to manage the data transfer length and a Re-Tuning Timer by the Host Driver.  						'00' Mode 1 						'01' Mode 2 						'10' Mode 3 						'11' Reserved. There are two re-tuning timings:Re-Tuning Request and expiration of a Re-Tuning Timer. By receiving either timing, the Host Driver executes the re-tuning procedure just before a next command issue. 						" range="47 - 46" rwaccess="R"/> 
		<bitfield id="TUNING_FOR_SDR50" width="1" begin="45" end="45" resetval="0x0" description=" 						If this bit is set to 1, this Host Controller requires tuning to operate SDR50. [Tuning is always required to operate SDR104]. 						'0'  						'1'  						" range="45" rwaccess="R"/> 
		<bitfield id="RETUNING_TIMER_CNT" width="4" begin="43" end="40" resetval="0x4" description=" 						This field indicates an initial value of the Re-Tuning Timer for Re-Tuning Mode 1 to 3. 						0h - Get information via other source 						1h = 1 seconds 						2h = 2 seconds 						3h = 4 seconds 						4h = 8 seconds 						------ 						n = 2[n-1] seconds 						------ 						Bh = 1024 seconds 						Fh - Ch = Reserved 						" range="43 - 40" rwaccess="R"/> 
		<bitfield id="DRIVERD_SUPPORT" width="1" begin="38" end="38" resetval="0x0" description=" 						This bit indicates support of Driver Type D for 1.8 Signaling. 						'0' Driver Type D is Not supported,  						'1' Driver Type D is supported 						" range="38" rwaccess="R"/> 
		<bitfield id="DRIVERC_SUPPORT" width="1" begin="37" end="37" resetval="0x0" description=" 						This bit indicates support of Driver Type C for 1.8 Signaling. 						'0' Driver Type C is Not supported,  						'1' Driver Type C is supported 						" range="37" rwaccess="R"/> 
		<bitfield id="DRIVERA_SUPPORT" width="1" begin="36" end="36" resetval="0x0" description=" 						This bit indicates support of Driver Type A for 1.8 Signaling. 						'0' Driver Type A is Not supported,  						'1' Driver Type A is supported 						" range="36" rwaccess="R"/> 
		<bitfield id="UHS2_SUPPORT" width="1" begin="35" end="35" resetval="0x0" description=" 						This bit indicates whether Host controller supports UHS-II. If this bit is set to 1, 1.8V VDD2 Support shall be set to 1 [Host Sys- tem shall support VDD2 power supply]. 								1 UHS-II is Supported 								0 UHS-II is Not Supported 						" range="35" rwaccess="R"/> 
		<bitfield id="DDR50_SUPPORT" width="1" begin="34" end="34" resetval="0x1" description=" 						This bit indicates whether DDR50 is supported or not. 						" range="34" rwaccess="R"/> 
		<bitfield id="SDR104_SUPPORT" width="1" begin="33" end="33" resetval="0x1" description=" 						This bit indicates whether SDR104 is supported or not.SDR104 requires tuning. 						" range="33" rwaccess="R"/> 
		<bitfield id="SDR50_SUPPORT" width="1" begin="32" end="32" resetval="0x1" description=" 						If SDR104 is supported, this bit shall be set to 1. Bit 40 indicates whether SDR50 requires tuning or not. 						" range="32" rwaccess="R"/> 
		<bitfield id="SLOT_TYPE" width="2" begin="31" end="30" resetval="0x0" description=" 						This field indicates usage of a slot by a specific Host System. [A host controller register set is defined perslot.] Embedded slot for one device [01b] means that only one non-removable device is connected to a SD bus slot. Shared Bus Slot [10b] can be set if Host Controller supports Shared Bus Control register. The Standard Host Driver controls only a removable card or one embedded device is connected to a SD bus slot. If a slot is configured for shared bus [10b], the Standard Host Driver does not control embedded devices connected to a shared bus. Shared bus slot is controlled by a specific host driver developed by a Host System.  						" range="31 - 30" rwaccess="R"/> 
		<bitfield id="ASYNCH_INTR_SUPPORT" width="1" begin="29" end="29" resetval="0x1" description=" 						Refer to SDIO Specification Version 3.00 about asynchronous interrupt. 						" range="29" rwaccess="R"/> 
		<bitfield id="ADDR_64BIT_SUPPORT_V3" width="1" begin="28" end="28" resetval="0x1" description=" 						IMeaning of this bit is different depends on Versions [Refer to Table 2-35 for more details]. Host Controller Version 3.00 and Ver4.10 use this bit as 64-bit System Address support for V3 mode. Host Con- troller Version 4.00 uses this bit as 64-bit System Address support for both V3 and V4 modes. 						SDMA cannot be used in 64-bit Address-ing in Version 3 mode. 						If this bit is set to 1, 64-bit ADMA2 with using 96-bit Descriptor may be enabled as follows: 						In case of Host Controller Version 3, 64-bit ADMA2 is enabled by DMA Select =11b in the Host Control 1 register. In case of Host Controller Version 4, 64-bitADMA2 for Version 3 is enabled by setting Host Version 4 Enable =0 and DMA Select = 11b. 								1 - 64-bit System Address for V3 is Supported 								0 - 64-bit System Address for V3 is not Supported 						" range="28" rwaccess="R"/> 
		<bitfield id="ADDR_64BIT_SUPPORT_V4" width="1" begin="27" end="27" resetval="0x1" description=" 						This bit is added from Version 4.10. Set-ting 1 to this bit indicates that the Host Controller supports 64-bit System Addressing of Version 4 mode [Refer to Table 2-35 for the summary of 64-bit sys-tem address support].. 						When this bit is set to 1, full or a part of 64-bit address should be used to decode Host Controller Registers so that Host Controller Registers can be placed above system memory area. 64-bit address decode of Host Controller Registers is effective regardless of setting to 64bit Addressing in Host Control 2. 						If this bit is set to 1, 64-bit DMA Address-ing for Version 4 is enabled by setting Host Version 4 Enable =1, 64-bit Address-ing =1 in the Host Control 2 register.SDMA can be used and ADMA2 uses 128-bit Descriptor. 						" range="27" rwaccess="R"/> 
		<bitfield id="VOLT_1P8_SUPPORT" width="1" begin="26" end="26" resetval="0x1" description=" 						This bit indicates whether the HC supports 1.8V. 						" range="26" rwaccess="R"/> 
		<bitfield id="VOLT_3P0_SUPPORT" width="1" begin="25" end="25" resetval="0x0" description=" 						This bit indicates whether the HC supports 3.0V. 						" range="25" rwaccess="R"/> 
		<bitfield id="VOLT_3P3_SUPPORT" width="1" begin="24" end="24" resetval="0x0" description=" 						This bit indicates whether the HC supports 3.3V. 						" range="24" rwaccess="R"/> 
		<bitfield id="SUSP_RES_SUPPORT" width="1" begin="23" end="23" resetval="0x1" description=" 						This bit indicates whether the HC supports Suspend / Resume functionality. If this bit is 0, the Suspend and Resume mechanism are not supported and the HD shall not issue either Suspend / Resume commands. 						" range="23" rwaccess="R"/> 
		<bitfield id="SDMA_SUPPORT" width="1" begin="22" end="22" resetval="0x1" description=" 						This bit indicates whether the HC is capable of using DMA to transfer data between system memory and the HC directly.Version 4.10 Host Controller shall support SDMA if ADMA2 is supported. 						" range="22" rwaccess="R"/> 
		<bitfield id="HIGH_SPEED_SUPPORT" width="1" begin="21" end="21" resetval="0x1" description=" 						This bit indicates whether the HC and the Host System support High Speed mode and they can supply SD Clock frequency from 25Mhz to 50 Mhz [for SD]/ 20MHz to 52MHz [for MMC]. 						" range="21" rwaccess="R"/> 
		<bitfield id="ADMA2_SUPPORT" width="1" begin="19" end="19" resetval="0x1" description=" 						'0' ADMA2 Not Supported 						'1' ADMA2 Supported 						" range="19" rwaccess="R"/> 
		<bitfield id="BUS_8BIT_SUPPORT" width="1" begin="18" end="18" resetval="0x1" description=" 						This bit indicates whether the Host Controller is capable of using 8-bit bus width mode. This bit is not effective when Slot Type is set to 10b. In this case, refer to Bus Width Preset in the Shared Bus resister. 						" range="18" rwaccess="R"/> 
		<bitfield id="MAX_BLK_LENGTH" width="2" begin="17" end="16" resetval="0x0" description=" 						This value indicates the maximum block size that the HD can read and write to the buffer in the HC. The buffer shall transfer this block size without wait cycles. Three sizes can be defined as indicated below. 						" range="17 - 16" rwaccess="R"/> 
		<bitfield id="BASE_CLK_FREQ" width="8" begin="15" end="8" resetval="0x200" description=" 						[1]6-bit Base Clock Frequency: 						This mode is supported by the Host Controller Version 1.00 and 2.00. Upper 2-bit is not effective and always 0. Unit values are 1MHz. The supported clock range is 10MHz to 63MHz.  						'11xx xxxxb' Not Supported 						'0011 1111b' 63MHz 						'0000 0010b' 2MHz 						'0000 0001b' 1MHz 						'0000 0000b'Get Information via another method   						[2]8-bit Base Clock Frequency: 						This mode is supported by the Host Controller Version 3.00.Unit values are 1MHz. The supported clock range is 10MHz to 255MHz. 						'FFh' 255MHz 						'02h' 2MHz 						'01h' 1MHz 						'00h' Get Information via another method.  If the real frequency is 16.5MHz, the lager value shall be set 0001 0001b [17MHz] because the Host Driver use this value to calculate the clock divider value [Refer to the SDCLK Frequency Select in the Clock Control register.] and it shall not exceed upper limit of the SD Clock frequency. If these bits are all 0, the Host System has to get information via another method.  						" range="15 - 8" rwaccess="R"/> 
		<bitfield id="TIMEOUT_CLK_UNIT" width="1" begin="7" end="7" resetval="0x0" description=" 						This bit shows the unit of base clock frequency used to detect Data Timeout Error.  						" range="7" rwaccess="R"/> 
		<bitfield id="TIMEOUT_CLK_FREQ" width="6" begin="5" end="0" resetval="0x1" description=" 						This bit shows the base clock frequency used to detect Data Timeout Error. 						'000000' Get Information via another method, 'not 0' 1KHz to 63KHz/1MHz to 63MHz  						" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_max_current_cap" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_max_current_cap" offset="0x48" width="64" description="This register indicates maximum current capability for each voltage">
		<bitfield id="VDD2_1P8V" width="8" begin="39" end="32" resetval="0x0" description="Maximum Current for 1.8V VDD2" range="39 - 32" rwaccess="R"/> 
		<bitfield id="VDD1_1P8V" width="8" begin="23" end="16" resetval="0x0" description="Maximum Current for 1.8V VDD1" range="23 - 16" rwaccess="R"/> 
		<bitfield id="VDD1_3P0V" width="8" begin="15" end="8" resetval="0x0" description=" 						Maximum Current for 3.0V VDD1 						" range="15 - 8" rwaccess="R"/> 
		<bitfield id="VDD1_3P3V" width="8" begin="7" end="0" resetval="0x0" description=" 						Maximum Current for 3.3V VDD1 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_force_evnt_ACMD_Err_Sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_force_evnt_ACMD_Err_Sts" offset="0x50" width="16" description="This register is not physically implemented, rather it is an address where Auto CMD Error Status register can be written.
							    Writing 1 : set each bit of the Auto CMD12 Error Status Register
								Writing 0 : no effect.
					">
		<bitfield id="CMD_NOT_ISS" width="1" begin="7" end="7" resetval="0x0" description="  						Force Event for Command Not Issued by AUTO CMD12 Error. 						" range="7" rwaccess="W"/> 
		<bitfield id="RESP" width="1" begin="5" end="5" resetval="0x0" description="  						Force Event for AUTO CMD Response Error.. 						" range="5" rwaccess="W"/> 
		<bitfield id="INDEX" width="1" begin="4" end="4" resetval="0x0" description="  						Force Event for AUTO CMD Index Error.. 						" range="4" rwaccess="W"/> 
		<bitfield id="ENDBIT" width="1" begin="3" end="3" resetval="0x0" description="  						Force Event for AUTO CMD End Bit Error. 						" range="3" rwaccess="W"/> 
		<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description="  						Force Event for AUTO CMD Timeout Error. 						" range="2" rwaccess="W"/> 
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="  						Force Event for AUTO CMD Timeout Error. 						" range="1" rwaccess="W"/> 
		<bitfield id="ACMD_NOT_EXEC" width="1" begin="0" end="0" resetval="0x0" description="  						Force Event for AUTO CMD12 Not Executed. 						" range="0" rwaccess="W"/>
	</register>
