ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_force_evnt_Err_Int_Sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_force_evnt_Err_Int_Sts" offset="0x52" width="16" description="This register is not physically implemented, rather it is an address where Error Interrupt Status register can be written.">
		<bitfield id="HOST" width="1" begin="12" end="12" resetval="0x0" description="  						Force Event for Host Error 						" range="12" rwaccess="W"/> 
		<bitfield id="RESP" width="1" begin="11" end="11" resetval="0x0" description="  						Force Event for Response Error 						" range="11" rwaccess="W"/> 
		<bitfield id="TUNING" width="1" begin="10" end="10" resetval="0x0" description="  						Force Event for Tuning Error. 						" range="10" rwaccess="W"/> 
		<bitfield id="ADMA" width="1" begin="9" end="9" resetval="0x0" description="  						Force Event for ADMA Error. 						" range="9" rwaccess="W"/> 
		<bitfield id="AUTO_CMD" width="1" begin="8" end="8" resetval="0x0" description="  						Force Event for Auto CMD Error.  						" range="8" rwaccess="W"/> 
		<bitfield id="CURR_LIM" width="1" begin="7" end="7" resetval="0x0" description="  						Force Event for Current Limit Error. 						" range="7" rwaccess="W"/> 
		<bitfield id="DAT_ENDBIT" width="1" begin="6" end="6" resetval="0x0" description="  						Force Event for Data End Bit Error.  						" range="6" rwaccess="W"/> 
		<bitfield id="DAT_CRC" width="1" begin="5" end="5" resetval="0x0" description="  						Force Event for Data CRC Error. 						" range="5" rwaccess="W"/> 
		<bitfield id="DAT_TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="  						Force Event for Data Timeout Error. 						" range="4" rwaccess="W"/> 
		<bitfield id="CMD_INDEX" width="1" begin="3" end="3" resetval="0x0" description="  						Force Event for Command Index Error 						" range="3" rwaccess="W"/> 
		<bitfield id="CMD_ENDBIT" width="1" begin="2" end="2" resetval="0x0" description="  						Force Event for Command End Bit Error. 						" range="2" rwaccess="W"/> 
		<bitfield id="CMD_CRC" width="1" begin="1" end="1" resetval="0x0" description="  						Force Event for Command CRC Error. 						" range="1" rwaccess="W"/> 
		<bitfield id="CMD_TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="  						Force Event for CMD Timeout Error. 						" range="0" rwaccess="W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_adma_err_status" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_adma_err_status" offset="0x54" width="8" description="When the ADMA Error interrupt occur, this register holds the ADMA State in ADMA Error States field and ADMA System Address holds address around the error descriptor">
		<bitfield id="ADMA_LENGTH_ERR" width="1" begin="2" end="2" resetval="0x0" description="  						This error occurs in the following 2 cases. While Block Count Enable being set, the total data length specified by the Descriptor table is different from that specified by the Block Count and Block Length. Total data length can not be divided by the block length. 						" range="2" rwaccess="R"/> 
		<bitfield id="ADMA_ERR_STATE" width="2" begin="1" end="0" resetval="0x0" description=" 						This field indicates the state of ADMA when error is occurred during ADMA data transfer. This field never indicates 10 because ADMA never stops in this state. 						D01  D00 : ADMA Error State when error occurred Contents of SYS_SDR register.  						" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_adma_sys_address" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_adma_sys_address" offset="0x58" width="64" description="This register contains the physical address used for ADMA data transfer">
		<bitfield id="ADMA_ADDR" width="64" begin="63" end="0" resetval="0x0" description=" 					The 32-bit addressing Host Driver uses lower 32-bit of this register [upper 32-bit should be set to 0] and shall program Descriptor Table on 32-bit boundary andset 32-bit boundary address to this register. DMA2/3 ignores lower 2-bit of this register and assumes it to be 00b. 					DMA in 64-bit addressing. The 64-bit addressing Host Driver uses all bits of this register and shall program Descriptor Table on 64-bit boundary and set 64-bit boundary address to this register. DMA2/3 ignores lower 3-bit of this register andassumes it to be 000b. 							SDMA 					If Host Version 4.00 Enable is set to 1, SDMA use this register to indicate System Address of data location instead of using SDMA System Address register [Offset 003-000h]. SDMA can be used in 32-bit and 64-bit addressing in Version 4.00. 							ADMA2 					This register holds byte address of executing command of the Descriptor table. At the start of ADMA2, the Host Driver shall set start address of the Descriptor table. The ADMA increments this register address, which points to next line, when every fetching a Descriptor line. When the ADMA Error Interrupt is generated, this register shall hold the Descriptor address depending on the ADMA state. 							ADMA3 					This register is set by ADMA3. Host Driver is not necessary to set this register. The ADMA3 increments address of this register,which points to next line, when every time fetching a Descriptor line. When Error Interrupt is generated, this register shall hold the Descriptor address depending on the ADMA state. 							Register Value - 00000000_xxxxxxxxh 						 	Addressing Mode - 32-bit System Address 						 	Register Value - xxxxxxxx_xxxxxxxxh 							Addressing Mode - 64-bit System Address 						" range="63 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value0" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value0" offset="0x60" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value 
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x256" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value1" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value1" offset="0x62" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value 
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x4" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value2" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value2" offset="0x64" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x2" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value3" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value3" offset="0x66" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x4" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value4" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value4" offset="0x68" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x2" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value5" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value5" offset="0x6A" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x1" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value6" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value6" offset="0x6C" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x0" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value7" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value7" offset="0x6E" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x2" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
