ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value8" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value8" offset="0x72" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x1" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value10" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_preset_value10" offset="0x74" width="16" description="
					This register is used to read the SDCLK Frequency Select Value,Clock Generator Select Value,Driver Strength Select Value
					">
		<bitfield id="DRIVER_STRENGTH_SEL" width="2" begin="15" end="14" resetval="0x0" description="Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling. 						" range="15 - 14" rwaccess="R"/> 
		<bitfield id="CLOCK_GENSEL" width="1" begin="10" end="10" resetval="0x0" description=" 						This bit is effective when Host Controller supports programmable clock 						'0'  Host Controller Ver2.00 Compatible Clock Generator 						'1' Programmable Clock Generator 						" range="10" rwaccess="R"/> 
		<bitfield id="SDCLK_FRQSEL" width="10" begin="9" end="0" resetval="0x0" description=" 						10-bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_adma3_desc_address" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_adma3_desc_address" offset="0x78" width="64" description="The start address of Integrated DMA Descriptor is set to this register.">
		<bitfield id="INTG_DESC_ADDR" width="64" begin="63" end="0" resetval="0x0" description=" 						The start address of Integrated DMA Descriptor is set to this register. Writing to a specific address starts ADMA3 depends on 32-bit/64-bit address-ing. The ADMA3 fetches one Descriptor Address and increments this field to indicate the next Descriptor address. 						The 32-bit addressing Host Driver uses lower 32- bit of this register and shall 						program Descriptor Table on 32-bit boundary.ADMA3 ignores lower 2-bit of this register and assumes it to be 00b. Writing to 07Bh starts ADMA3 data transfer. 						The 64-bit addressing Host Driver uses all 64-bit of this register and shall program Descriptor Table on 64-bit boundary. ADMA3 ignores lower 3-bit of this register and assumes it to be 000b. Writing to 07Fh starts ADMA3 data transfer. 						Register Value- 00000000_xxxxxxxxh Addressing Mode - 32-bit System Address 						Register Value - xxxxxxxx_xxxxxxxxh Addressing Mode - 64-bit System Address 						" range="63 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_block_size" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_block_size" offset="0x80" width="16" description="This register is used to configure the number of bytes in a data block">
		<bitfield id="SDMA_BUF_BOUNDARY" width="3" begin="14" end="12" resetval="0x0" description=" 							When system memory is managed by paging, SDMA data transfer is performed in unit of paging. A page size of sys-tem memory management is set to this field. 							Host Controller generates the DMA Interrupt at the page boundary and requests the Host Driver to update the ADMA System Address register. SDMA waits until the ADMA System Address register is written. 							At the end of transfer, the Host Controller may issue or may not issue DMA Interrupt. In particular, DMA Interrupt shall not be issued after Transfer Complete Interrupt is issued. 							These bits shall be supported when the SDMA Support in the Capabilities register is set to 1 and this function is active when the DMA Enable in the UHS-II Transfer Mode register is set to 1. ADMA does not use this field. 						" range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="XFER_BLK_SIZE" width="12" begin="11" end="0" resetval="0x0" description="This register specifies the block size of data packet. SD Memory Card uses a fixed block size of 512 bytes. Vari-able block size may be used for SDIO. The maximum value is 2048 Bytes because CRC16 covers up to 2048 bytes. This register is effective when Data Present is set to 1 in UHS-II Command register. 	    " range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_block_count" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_block_count" offset="0x84" width="32" description="This register is used to configure the number of data blocks">
		<bitfield id="XFER_BLK_COUNT" width="32" begin="31" end="0" resetval="0x0" description=" 						This register is effective when Data Present is set to 1 in UHS-II Command register and is enabled when Block Count Enable is set to 1 and Block / Byte Mode is set to 0 in the UHS-II Transfer Mode register. Data transfer stops when the count reaches zero. Setting the block count to 0 results in no data blocks is transferred. 						This register should be accessed only when no transaction is executing [i.e.,after transactions are stopped]. During data transfer, read operations on this register may return an invalid   value and write operations are ignored. 								00000000h - Stop Count 								00000001h - 1 block 								00000002h - 2 blocks 								..... ..... 								FFFFFFFFh - 4G blocks -1. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_command_pkt" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_command_pkt" offset="0x88" width="8" description="UHS-II Command Packet image is set to this register. The maximum length is 20 bytes. The command length varies depends on a Command Packet type. The length is specified by the UHS-II Command register.
					">
		<bitfield id="CMD_PKT_BYTE" width="8" begin="7" end="0" resetval="0x0" description="UHS-II Command Packet image is set to this register.The command length varies depends on a Command Packet type. 						" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_xfer_mode" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_xfer_mode" offset="0x9C" width="16" description="This register is used to control the operations of data transfers">
		<bitfield id="DUPLEX_SELECT" width="1" begin="15" end="15" resetval="0x0" description=" 						Use of 2 lane half duplex mode is determined by Host Driver. 						" range="15" rwaccess="R/W"/> 
		<bitfield id="EBSY_WAIT" width="1" begin="14" end="14" resetval="0x0" description=" 									This bit is set when issuing a command which is accompanied by EBSY packet to indicate end of command execution. Busy is expected for CCMD with R1b/R5b type and DCMD with data transfer.If this bit is set to 1, Host Controller waits receiving of EBSY packet and on receiving EBSY packet, Transfer Com-plete in the Normal Interrupt Status reg-ister is set to 1 to indicate end ofbusy. If an error is indicated in EBSY packet [ex. Memory Error], EBSY Error in the UHS-II Error Interrupt Status register is set to 1. Setting of EBSY Error also sets Error Interrupt to 1 in the Normal Inter-rupt Status register. Error Interrupt and Transfer Complete shall be set together. 						'1' Wait EBSY, 						'0' Issue a command without busy. 						" range="14" rwaccess="R/W"/> 
		<bitfield id="RESP_INTR_DIS" width="1" begin="8" end="8" resetval="0x0" description=" 							Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver. Only R1 or R5 can be checked. 							If Host Driver checks response error, sets this bit to 0 and waits Command Complete Interrupt and then check the response register. If Host Controller checks response error, sets this bit to 1 and sets Response Error Check Enable to 1. Command Complete Interrupt is disabled by this bit regardless of Com-mand Complete Signal Enable. 						" range="8" rwaccess="R/W"/> 
		<bitfield id="RESP_ERR_CHK_ENA" width="1" begin="7" end="7" resetval="0x0" description=" 						Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver.Only R1 or R5 can be checked. 						If Host Driver checks response error, this bit is set to 0 and Response Inter-rupt Disable is set to 0. If Host Control-ler checks response error, sets this bit to 1 and sets Response Interrupt Dis-able to 1. Response Type R1 / R5 selects either R1 or R5 response type. If an error is detected, RES Packet Error Interrupt is generated in the UHS-II Error Interrupt Status register. 						" range="7" rwaccess="R/W"/> 
		<bitfield id="RESP_TYPE" width="1" begin="6" end="6" resetval="0x0" description=" 								When response error check is enabled, this bit selects either R1 or R5 response 								types. Two types of response checks are supported: R1 for memory and R5 for SDIO. 								Error Statuses Checked in R1 									 Bit31 OUT_OF_RANGE 									 Bit30 ADDRESS_ERROR 									 Bit29 BLOCK_LEN_ERROR 									 Bit26 WP_VIOLATION 									 Bit25 CARD_IS_LOCKED 									 Bit23 COM_CRC_ERROR 									 Bit21 CARD_ECC_FAILED 									 Bit20 CC_ERROR 									 Bit19 ERROR 								Response Flags Checked in R5 									.Bit07 COM_CRC_ERROR 									.Bit03 ERROR 									.Bit01 FUNCTION_NUMBER 									.Bit00 OUT_OF_RANGE 						" range="6" rwaccess="R/W"/> 
		<bitfield id="BYTE_MODE" width="1" begin="5" end="5" resetval="0x0" description=" 						This bit specifies whether data transfer is in byte mode or block mode when Data Present is set to 1. This bit is effective to a command with data trans-fer. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="DATA_XFER_DIR" width="1" begin="4" end="4" resetval="0x0" description=" 							This bit specifies direction of data trans-fer when Data Present is set to 1. This bit is effective to a command with data transfer.  								0 - Read [Card to Host] 								1 - Write [Host to Card] 						" range="4" rwaccess="R/W"/> 
		<bitfield id="BLK_CNT_ENA" width="1" begin="1" end="1" resetval="0x0" description=" 						This bit specifies whether data transfer usesUHS-II Block Count register. If this bit is set to 1, data transfer is terminated by Block Count. Setting to UHS-II Block Count register shall  be equivalent to TLEN in UHS-II Command Packet reg-ister. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="DMA_ENA" width="1" begin="0" end="0" resetval="0x0" description="This bit selects whether DMA is used or not and is effective to a command with data transfer. One of DMA types is selected by DMA Select in the Host Control 1 register. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_command" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_command" offset="0x9E" width="16" description="This register is used to program the Command for host controller">
		<bitfield id="PKT_LENGTH" width="5" begin="12" end="8" resetval="0x0" description="A command packet length, which is set in the UHS-II Command Packet register, is set to this register. 								        00011b - 00000b - 3-0 Bytes [Not used] 									00100b - 4 Bytes 									.......... ...... 									10100b - 20 Bytes 									11111b  10101b 						" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CMD_TYPE" width="2" begin="7" end="6" resetval="0x0" description=" 						     This field is used to distinguish a spe-cific command like abort command. If this field is set to 00b, the UHS-II RES Packet is stored in UHS-II Response register [0B3h-0A0h]. To avoid overwrit-ing the UHS-II Response register, when this filed is set to 01b, the RES Packet [4 bytes length] of TRANS_ABORT CCMD is stored in the Response regis-ter [013h-010h] and when this filed is set to 10b, the RES Packet [8 bytes length] of memory or SDIO abort com-mand [CMD12 or SDIO Abort com-mand] is stored in the Response register [01Fh-018h]. When this filed is set to 11b, Host Controller controls lane to go into dormant state. 						'00' Normal Command 						'01' TRANS_ABORT CCMD 						'10' CMD12 or SDIO Abort Command 						'11' Go Dormant Command 						" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="DATA_PRESENT" width="1" begin="5" end="5" resetval="0x0" description="This bit specifies whether the command is accompanied by data packet. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="SUB_COMMAND" width="1" begin="2" end="2" resetval="0x0" description="This bit is added from Version 4.10 to distinguish a main command or sub command [Refer to Section 1.17].When issuing a main command, this bit is set to 0 and when issuing a sub com-mand, this bit is set to 1. Setting of this bit is checked by Sub Command Status in the Present State register. 						" range="2" rwaccess="R/W"/>
	</register>
