ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_response" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_response" offset="0xA0" width="8" description="This register is used to store received UHS-II RES Packet image">
		<bitfield id="RESP_PKT_BYTE" width="8" begin="7" end="0" resetval="0x0" description=" 						Host Controller saves received UHS-II RES Packet image to this register except the response of an abort command. 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_message_select" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_message_select" offset="0xB4" width="8" description="This register is used to access internal buffer">
		<bitfield id="MSG_SEL" width="2" begin="1" end="0" resetval="0x0" description=" 						Host Controller holds 4 MSG packets in FIFO buffer.One of 4 MSGs can be read from the UHS-II MSG register [0BB-0B8h] by setting this register.[Assumed for debug usage.] 						'00' The latest MSG 						'01' One MSG before 						'10' Two MSGs before 						'11' Three MSGs before 						" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_message" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_message" offset="0xB8" width="32" description="This register is used to access internal buffer">
		<bitfield id="MSG_BYTE3" width="8" begin="31" end="24" resetval="0x0" description=" 						  Host Controller holds 4 MSG packets in FIFO buffer. One of 4 MSGs [length is 4 bytes] can be read fromthis register by setting UHS-II MSG Select register. Usually 2 duplicate MSG packets are sent from/toUHS-II card. One of these 2 MSG packets which Host Controller recognizes as valid one is stored in theUHS-II MSG Register. 						" range="31 - 24" rwaccess="R"/> 
		<bitfield id="MSG_BYTE2" width="8" begin="23" end="16" resetval="0x0" description=" 						 Host Controller holds 4 MSG packets in FIFO buffer. One of 4 MSGs [length is 4 bytes] can be read fromthis register by setting UHS-II MSG Select register. Usually 2 duplicate MSG packets are sent from/toUHS-II card. One of these 2 MSG packets which Host Controller recognizes as valid one is stored in theUHS-II MSG Register. 						" range="23 - 16" rwaccess="R"/> 
		<bitfield id="MSG_BYTE1" width="8" begin="15" end="8" resetval="0x0" description=" 						 Host Controller holds 4 MSG packets in FIFO buffer. One of 4 MSGs [length is 4 bytes] can be read fromthis register by setting UHS-II MSG Select register. Usually 2 duplicate MSG packets are sent from/toUHS-II card. One of these 2 MSG packets which Host Controller recognizes as valid one is stored in theUHS-II MSG Register. 						" range="15 - 8" rwaccess="R"/> 
		<bitfield id="MSG_BYTE0" width="8" begin="7" end="0" resetval="0x0" description=" 						 Host Controller holds 4 MSG packets in FIFO buffer. One of 4 MSGs [length is 4 bytes] can be read fromthis register by setting UHS-II MSG Select register. Usually 2 duplicate MSG packets are sent from/toUHS-II card. One of these 2 MSG packets which Host Controller recognizes as valid one is stored in theUHS-II MSG Register. 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_intr_status" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_intr_status" offset="0xBC" width="16" description="This register shows receipt of INT MSG from which device
					">
		<bitfield id="DEV_INT_STS" width="16" begin="15" end="0" resetval="0x0" description="This register shows receipt of INT MSG from which device and is effective when INT MSG Enable is set to 1 in the UHS- II Device Select register. On receiving INT MSG from a device, Host Controller saves the INT MSG to UHS-II Device Interrupt Code register. A bit of this register, which is corre- spondent to Device ID, is set to 1 and generate Card Interrupt in Normal Interrupt Status register. 							Writing a bit to 1 clears the status bit [interrupt is treated] and writing a bit to 0 keeps the status value [interrupt is untreated]. If INT MSG Enable is set to 0, this register is cleared to 0 and Host Controller ignores receipt of INT MSG. 							Effective bit range of this register is determined by Number of Devices Supported in the UHS-II General Capabilities regis-ter. If N devices are supported, bits 1 to N are          effective. Then Device ID is supposed to be assigned from 1 sequentially at the UHS-II Initialization. A bit of unsupported Device ID in this register shall be indicated to 0. 							D00 - Not used [Reserved] 							D01 - Setting 1 means INT MSG is received from Device ID 1 							D02 - Setting 1 means INT MSG is received from Device ID 2 							.... ..... 							D15 - Setting 1 means INT MSG is received from Device ID 15 						" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_select" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_select" offset="0xBE" width="8" description="UHS-II Device Select Register
					">
		<bitfield id="INT_MSG_ENA" width="1" begin="7" end="7" resetval="0x0" description="  							This bit enables receipt of INT MSG. If this bit is set to 1,receipt of INT MSG is informed by Card Interrupt in the Nor-mal Interrupt Status register. If this bit is set to 0, Host Con-troller ignores receipt of INT MSG and may not set the UHS-II Device Interrupt Code register. 							Support of INT MSG Interrupt is optional. If trying to set this bit to 1 but still this bit is read 0, INT MSG Interrupt is not sup-ported by the Host Controller. In this case, UHS-II Device Interrupt Status register always shall be read 0 and UHS-II Device Interrupt Code register may not be implemented. 						'0' Disabled 						'1' Enabled 						" range="7" rwaccess="R/W"/> 
		<bitfield id="DEV_SEL" width="4" begin="3" end="0" resetval="0x0" description="Host Controller holds an INT MSG packet per device. One of INT MSGs [up to 15] can be selected by this field and read from the UHS-II Device Interrupt Code Register     [0BFh]. This field is effective when INT MSG Enable is set to 1. 						The number of devices implemented in the Host Controller is indicated by Number of Devices supported in the UHS-II General Capabilities register. 						0h Unselected [Default] 						1h INT MSG of Device ID 1 is selected 						2h INT MSG of Device ID 2 is selected 						..... ..... 						Fh INT MSG of Device ID 15 is selected 						" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_int_code" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_device_int_code" offset="0xBF" width="8" description="This register is effective when INT MSG Enable is set to 1 in the UHS-II Device Select register.
					">
		<bitfield id="DEV_INTR" width="8" begin="7" end="0" resetval="0x0" description="This register is effective when INT MSG Enable is set to 1 in the UHS-II Device Select register. Host Controller holds an INT MSG packet per device. One of INT MSGs     [Code length is 1 byte] up to 15 can be read from this register by select-ing UHS-II Device Select. The number of the registers to hold INT MSGs is determined by Number of Devices Sup-ported in the UHS-II General Capabili-ties register. Device ID is supposed to be assigned from 1 sequentially at the UHS-II Initialization. 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_software_reset" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_software_reset" offset="0xC0" width="16" description="UHS-II Software Reset Register
					">
		<bitfield id="HOST_SDTRAN_RESET" width="1" begin="1" end="1" resetval="0x0" description="Host Driver set this bit to 1 to reset SD-TRAN layer when CMD0 is issued to Device or data transfer error occurs. This bit is cleared automatically at completionof SD-TRAN reset. If CMD0 is issued, SD-TRAN Initial- ization sequence from CMD8 is required to use UHS-II mode. Assuming that bus power is maintained and CM-TRAN Initialization is not required. 								'0' Not Affected 								'1' Reset SD TRAN 								Host Controller requires to do followings: 									[1] SD Clock Enable is maintained.[Continue to provide RCLK]. 									[2] All setting register is maintained. 									[3] Internal sequencers are reset to just after power on.be able to issue a command. 									[4] All Interrupt Status, Status Enable and Signal Enable are cleared. 									[5] Data transfer is terminated and data in buffer is dis-carded. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="HOST_FULL_RESET" width="1" begin="0" end="0" resetval="0x0" description="On issuing FULL_RESET CCMD, Host Driver set this bit to 1 to reset Host Controller. This bit is cleared auto-matically at completion of Host Controller reset. Initial- ization sequence from PHY Initialization is required to use UHS-II mode. Assuming that bus power is maintained. 							Host Controller requires to do followings: 								[1] SD Clock Enable is cleared. [Internal Clock is still synchronized]. 								[2] All setting register is cleared. 								[3] Internal sequencers are reset to just after power on. 								[4] All Interrupt Status, Status Enable and Signal Enable are cleared. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_timer_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_timer_control" offset="0xC2" width="16" description="UHS-II Timeout Control Register">
		<bitfield id="DEADLOCK_TIMEOUT_CTR" width="4" begin="7" end="4" resetval="0x0" description=" 						This value determines the deadlock period while host expecting to receive a packet [1 second]. Tim-eout clock frequency will be generated by dividing the base clock TMCLK value by this value. When setting this register, prevent inadvertent timeout events by clearing the Timeout for Deadlock [in the UHS-II Error Interrupt Status Enable register] 								1111b Reserved 								1110b TMCLK x 2^27 								.............. .................. 								0001b TMCLK x 2^14 								0000b TMCLK x 2^13 						" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CMDRESP_TIMEOUT_CTR" width="4" begin="3" end="0" resetval="0x0" description=" 						This value determines the interval between com-mand packet and response packet [5ms]. Timeout clock frequency will be generated by dividing the base clock TMCLK value by this value. When   set-ting this register, prevent inadvertent timeout events by clearing the Timeout for CMD_RES [in the UHS-II Error Interrupt Status Enable register] 								1111b Reserved 								1110b TMCLK x 2^27 								.............. .................. 								0001b TMCLK x 2^14 								0000b TMCLK x 2^13 						" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sts" offset="0xC4" width="32" description="This register gives the status of all UHS-II interrupts">
		<bitfield id="VENDOR_SPECFIC_ERR" width="5" begin="31" end="27" resetval="0x0" description="  						Vendor may use this field for vendor specific error status. 						'0' Interrupt is not generated 						'1' Vendor Specific Error 						" range="31 - 27" rwaccess="R/W1TC"/> 
		<bitfield id="DEADLOCK_TIMEOUT" width="1" begin="17" end="17" resetval="0x0" description="  						Setting of this bit means that deadlock timeout occurs. Host expects to receive a packet but not received in a specified timeout [1 second]. Timeout value is determined by the setting of Timeout Counter Value for Deadlock in UHS-II Timer Control register. 						" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CMD_RESP_TIMEOUT" width="1" begin="16" end="16" resetval="0x0" description="  							Setting of this bit means that RES Packet timeout occurs. Host expects to receive RES packet but not received in a specified timeout [5ms]. Timeout value is determined by the setting of Timeout Counter Value for CMD_RES in UHS-II Timer Control register. 						" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="ADMA2_ADMA3" width="1" begin="15" end="15" resetval="0x0" description="  							Setting of this bit means that ADMA2/3 Error occurs in UHS-II mode. ADMA2/3 Error Status is indicated to the ADMA Error Status [054h], which is defined in the Host spec 3.00. 						" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="EBSY" width="1" begin="8" end="8" resetval="0x0" description="  						On receiving EBSY packet, if the packet indicates an error, this bit is set to 1. Setting of this bit also sets Error Interrupt and Transfer Completer together in the Normal Interrupt Status register. This error check is effective for a command with setting EBSY Wait in the UHS-II Transfer Mode register. 						" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="UNRECOVERABLE" width="1" begin="7" end="7" resetval="0x0" description="  						Setting of this bit means that Unrecoverable Error is set in a packet from a device. 						" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="TID" width="1" begin="5" end="5" resetval="0x0" description="  						Setting of this bit means that TID Error occurs. 						" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="FRAMING" width="1" begin="4" end="4" resetval="0x0" description="  						Setting of this bit means that Framing Error occurs during a packet receiving. 						" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CRC" width="1" begin="3" end="3" resetval="0x0" description="  						Setting of this bit means that CRC Error occurs during a packet receiving. 						" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="RETRY_EXPIRED" width="1" begin="2" end="2" resetval="0x0" description="  						Setting of this bit means that Retry Counter Expired Error occurs during data transfer.If this bit is set,either Framing Error or CRC Error in this register shall be set. 						" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="RESP_PKT" width="1" begin="1" end="1" resetval="0x0" description="  							Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver during DMA execution. If Response Error Check Enable is set to1 in the UHS- II Transfer Mode register, Host Controller Checks R1 or R5 response. If an error is detected in a response,this bit is set to 1. 						" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="HEADER" width="1" begin="0" end="0" resetval="0x0" description="  						Setting of this bit means that Header Error occurs in a received packet. 						" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sts_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sts_ena" offset="0xC8" width="32" description="This register is used to enable the UHS-II Error Interrupt Status register fields">
		<bitfield id="VENDOR_SPECFIC" width="5" begin="31" end="27" resetval="0x0" description="  								Setting this bit to 1 enables setting of Vendor Specific Error bit in the UHS-II Error Interrupt Status register. 										0h - Status is Disabled 										1h - Status is Enabled 						" range="31 - 27" rwaccess="R/W"/> 
		<bitfield id="DEADLOCK_TIMEOUT" width="1" begin="17" end="17" resetval="0x0" description="  								Setting this bit to 1 enables setting of Timeout for Dead lock bit in the UHS-II Error Interrupt Status register. 						" range="17" rwaccess="R/W"/> 
		<bitfield id="CMD_RESP_TIMEOUT" width="1" begin="16" end="16" resetval="0x0" description="  								Setting this bit to 1 enables setting of Timeout for CMD_RES bit in the UHS-II Error Interrupt Status register. 						" range="16" rwaccess="R/W"/> 
		<bitfield id="ADMA2_ADMA3" width="1" begin="15" end="15" resetval="0x0" description="  								Setting this bit to 1 enables setting of ADMA2/3 Error bit in the UHS-II Error Interrupt Status register. 						" range="15" rwaccess="R/W"/> 
		<bitfield id="EBSY" width="1" begin="8" end="8" resetval="0x0" description="  								Setting this bit to 1 enables setting of EBSY Error bit in the UHS-II Error Interrupt Status register. 						" range="8" rwaccess="R/W"/> 
		<bitfield id="UNRECOVERABLE" width="1" begin="7" end="7" resetval="0x0" description="  								Setting this bit to 1 enables setting of Unrecoverable Error bit in the UHS-II Error Interrupt Status register. 						" range="7" rwaccess="R/W"/> 
		<bitfield id="TID" width="1" begin="5" end="5" resetval="0x0" description="  								Setting this bit to 1 enables setting of TID Error bit in the UHS-II Error Interrupt Status register. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="FRAMING" width="1" begin="4" end="4" resetval="0x0" description="  								Setting this bit to 1 enables setting of Framing Error bit in the UHS-II Error Interrupt Status register. 						" range="4" rwaccess="R/W"/> 
		<bitfield id="CRC" width="1" begin="3" end="3" resetval="0x0" description="  								Setting this bit to 1 enables setting of CRC Error bit in the UHS-II Error Interrupt Status register. 						" range="3" rwaccess="R/W"/> 
		<bitfield id="RETRY_EXPIRED" width="1" begin="2" end="2" resetval="0x0" description="  								Setting this bit to 1 enables setting of Retry Expired bit in the UHS-II Error Interrupt Status register. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="RESP_PKT" width="1" begin="1" end="1" resetval="0x0" description="  								Setting this bit to 1 enables setting of RES Packet Error bit in the UHS-II Error Interrupt Status register. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="HEADER" width="1" begin="0" end="0" resetval="0x0" description="  								Setting this bit to 1 enables setting of Header Error bit in the UHS-II Error Interrupt Status Register. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sig_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_err_intr_sig_ena" offset="0xCC" width="32" description="This register is used to generate UHS-II Interrupt signals">
		<bitfield id="VENDOR_SPECFIC" width="5" begin="31" end="27" resetval="0x0" description="  						Setting of a bit to 1 in this field enables generating interrupt signal when corre-spondent bit of Vendor Specific Error is set in the UHS-II Error Interrupt Status Register. 										0h - Interrupt Signal is Disabled 										1h - Interrupt Signal is Enabled 						" range="31 - 27" rwaccess="R/W"/> 
		<bitfield id="DEADLOCK_TIMEOUT" width="1" begin="17" end="17" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when Timeout for Dead lock bit is set in the UHS-II Error InterruptStatus Register. 						" range="17" rwaccess="R/W"/> 
		<bitfield id="CMD_RESP_TIMEOUT" width="1" begin="16" end="16" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when Timeout for CMD_RES bit is set in the UHS-II Error InterruptStatus Register. 						" range="16" rwaccess="R/W"/> 
		<bitfield id="ADMA2_ADMA3" width="1" begin="15" end="15" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when ADMA2/3 Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="15" rwaccess="R/W"/> 
		<bitfield id="EBSY" width="1" begin="8" end="8" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when EBSY Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="8" rwaccess="R/W"/> 
		<bitfield id="UNRECOVERABLE" width="1" begin="7" end="7" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when Unrecoverable Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="7" rwaccess="R/W"/> 
		<bitfield id="TID" width="1" begin="5" end="5" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when TID Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="5" rwaccess="R/W"/> 
		<bitfield id="FRAMING" width="1" begin="4" end="4" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when Framing Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="4" rwaccess="R/W"/> 
		<bitfield id="CRC" width="1" begin="3" end="3" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when CRC Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="3" rwaccess="R/W"/> 
		<bitfield id="RETRY_EXPIRED_SIG_ENA" width="1" begin="2" end="2" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when Retry Expired bit is set in the UHS-II Error InterruptStatus Register. 						" range="2" rwaccess="R/W"/> 
		<bitfield id="RESP_PKT" width="1" begin="1" end="1" resetval="0x0" description="  						Setting this bit to 1 enables generating interrupt signal when RES Packet Error bit is set in the UHS-II Error InterruptStatus Register. 						" range="1" rwaccess="R/W"/> 
		<bitfield id="HEADER" width="1" begin="0" end="0" resetval="0x0" description=" Setting this bit to 1 enables generating interrupt signal when Header Error bit is set in the UHS-II Error Interrupt Status Register. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_settings_ptr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_settings_ptr" offset="0xE0" width="16" description="
					This register is pointer for UHS-II settings.
					">
		<bitfield id="UHS2_SETTINGS_PTR" width="16" begin="15" end="0" resetval="0x256" description="Pointer for UHS-II Settings Register" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_capabilities_ptr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_capabilities_ptr" offset="0xE2" width="16" description="
					This register is pointer for UHS-II Capabilities Register.
					">
		<bitfield id="UHS2_CAPABILITIES_PTR" width="16" begin="15" end="0" resetval="0x272" description="Pointer for UHS-II Capabilities Register" range="15 - 0" rwaccess="R"/>
	</register>
