ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_test_ptr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_test_ptr" offset="0xE4" width="16" description="
					This register is pointer for UHS-II Test Register.
					">
		<bitfield id="UHS2_TEST_PTR" width="16" begin="15" end="0" resetval="0x288" description="Pointer for UHS-II Test Register" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_shared_bus_ctrl_ptr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_shared_bus_ctrl_ptr" offset="0xE6" width="16" description="
					This register is pointer for UHS-II Shared Bus Control Register.
					">
		<bitfield id="SHARED_BUS_CTRL_PTR" width="16" begin="15" end="0" resetval="0x304" description="Pointer for Shared Bus Control Register" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_vendor_specfic_ptr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_vendor_specfic_ptr" offset="0xE8" width="16" description="
					This register is pointer for UHS-II Vendor Specific Pointer Register.
					">
		<bitfield id="VENDOR_SPECFIC_PTR" width="16" begin="15" end="0" resetval="0x320" description="Pointer for Vendor Specific Area" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_boot_timeout_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_boot_timeout_control" offset="0xF4" width="32" description="This is used to program the boot timeout value counter">
		<bitfield id="DATA_TIMEOUT_CNT" width="32" begin="31" end="0" resetval="0x0" description=" 						This value determines the interval by which DAT line time-outs are detected during boot operation for eMMC4.4 card.The value is in number of sd clock. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_vendor_register" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_vendor_register" offset="0xF8" width="32" description="Vendor register added for autogate sdclk, cmd11 power down timer, enhancedstrobe and eMMC hardware reset">
		<bitfield id="AUTOGATE_SDCLK" width="1" begin="16" end="16" resetval="0x0" description="If this bit is set, SD CLK will be gated automatically when there is no transfer. This is applicable only for Embedded Device" range="16" rwaccess="R/W"/> 
		<bitfield id="CMD11_PD_TIMER" width="14" begin="15" end="2" resetval="0x5000" description="cmd11 power-down timer value 						" range="15 - 2" rwaccess="R/W"/> 
		<bitfield id="EMMC_HW_RESET" width="1" begin="1" end="1" resetval="0x0" description="Hardware reset signal is generared for eMMC card when this bit is set 						" range="1" rwaccess="R/W"/> 
		<bitfield id="ENHANCED_STROBE" width="1" begin="0" end="0" resetval="0x0" description="This bit enables the enhanced strobe logic of the Host Controller" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_slot_int_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_slot_int_sts" offset="0xFC" width="16" description="This register is used to read the interrupt signal for each slot.">
		<bitfield id="INTR_SIG" width="8" begin="7" end="0" resetval="0x0" description=" 						These status bits indicate the logical OR of Interrupt signal and Wakeup signal for each slot. 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_host_controller_ver" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_host_controller_ver" offset="0xFE" width="16" description="This register is used to read the vendor version number and specification version number
					">
		<bitfield id="VEN_VER_NUM" width="8" begin="15" end="8" resetval="0x16" description=" 						The Vendor Version Number is set to 0x10 [1.0] 						" range="15 - 8" rwaccess="R"/> 
		<bitfield id="SPEC_VER_NUM" width="8" begin="7" end="0" resetval="0x4" description=" 						This status indicates the Host Controller Spec. Version. The upper and lower 4-bits indicate the version. 						00h - SD Host Controller Specification Version 1.00 						01h - SD Host Controller Specification Version 2.00 Including the feature of the ADMA and Test Register 						02h - SD Host Controller Specification Version 3.00 						03h - SD Host Controller Specification Version 4.00 						04h - SD Host Controller Specification Version 4.10 						'others' Reserved 						" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_gen_settings" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_gen_settings" offset="0x100" width="32" description="Start Address of General settings is pointed by Pointer for UHS-II Setting Register.
					">
		<bitfield id="NUMLANES" width="6" begin="13" end="8" resetval="0x0" description=" 						The lane configuration of a Host System is set to this field depends on the capability among Host Controller and connected devices. 2 Lanes FD mode is mandatory and the others modes are optional. 							0000b - 2 Lanes FD or 2L-HD 							0001b - Not Used 							0010b - 3 Lanes 2D1U-FD [Embedded] 							0011b - 3 Lanes 1D2U-FD [Embedded] 							0100b - 4 Lanes 2D2U-FD [Embedded] 							others - Reserved 						" range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="POWER_MODE" width="1" begin="0" end="0" resetval="0x0" description="  						This field determines either Fast mode or Low Power mode.Host and all devices connected to the host shall be set to the same mode.  						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_phy_settings" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_phy_settings" offset="0x104" width="32" description="Start Address of PHY settings is pointed by Pointer for UHS-II Setting Register.
					">
		<bitfield id="N_LSS_DIR" width="4" begin="23" end="20" resetval="0x0" description="The largest value of N_LSS_DIR capabilities among the Host Controller and Connected Devices is set to this field. 									0h - 8 x16 LSS 									1h - 8 x 1 LSS 									2h - 8 x 2 LSS 									3h - 8 x 3 LSS 									...... 									...... 									Fh - 8 x 15 LSS 	 						" range="23 - 20" rwaccess="R/W"/> 
		<bitfield id="N_LSS_SYN" width="4" begin="19" end="16" resetval="0x0" description="The largest value of N_LSS_SYN capabilities among the Host Controller and Connected Devices is set to this field. 									0h - 4 x16 LSS 									1h - 4 x 1 LSS 									2h - 4 x 2 LSS 									3h - 4 x 3 LSS 									...... 									...... 									Fh - 4 x 15 LSS  						" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="HIBERNATE_ENA" width="1" begin="15" end="15" resetval="0x0" description="After checking card capability of Hibernate mode, if all devices support Hibernate mode, this bit may be set. This bit determines whether Host remains in Dormant state or goes to Hibernate state. In Hibernate mode, VDD1 Power may be off.  						" range="15" rwaccess="R/W"/> 
		<bitfield id="SPEED_RANGE" width="2" begin="7" end="6" resetval="0x0" description="PLL multiplier is selected by this field.Change of PLL Multiplier is not effective immediately and is applied from exiting Dormant State.  						'00' Range A [Default] 						'01' Range B 						'10' Reserved 						'11' Reserved 						" range="7 - 6" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_lnk_trn_settings" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_lnk_trn_settings" offset="0x108" width="64" description="Start Address of LINK/TRAN settings is pointed by Pointer for UHS-II Setting Register.
					">
		<bitfield id="N_DATA_GAP" width="8" begin="39" end="32" resetval="0x0" description=" 						The largest value of N_DATA_GAP capabilities among the Host Controller and Connected Devices is set to this field. 								00h - No Gap 								01h - 1 LSS 								02h - 2 LSS 								03h - 3 LSS 								...... 								...... 								FFh - 255 LSS 					      						" range="39 - 32" rwaccess="R/W"/> 
		<bitfield id="RETRY_COUNT" width="2" begin="17" end="16" resetval="0x0" description=" 						Data Burst retry count is set to this field. 						'00' Retry Disabled 						'01' 1 time 						'10' 2 times 						'11' 3 times 						" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="HOST_NFCU" width="8" begin="15" end="8" resetval="0x0" description=" 							Host Driver sets the number of blocks in Data Burst [Flow Control] to this field.The value shall be smaller than or equal to N_FCU capabilities among the Host Controller and connected card and devices. Setting 1 to 4 blocks is recommended considering buffer size. 							00h - 256 Blocks 							01h - 1 Block 							02h - 2 Blocks 							03h - 3 Blocks 							...... 							...... 							FFh - 255 Blocks 						" range="15 - 8" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_gen_cap" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_gen_cap" offset="0x110" width="32" description="Start Address of General Capabilities is pointed by Pointer for UHS-II Host Capabilities Register.
					">
		<bitfield id="CORECFG_UHS2_BUS_TOPLOGY" width="2" begin="23" end="22" resetval="0x0" description="This field indicates one of bus topologies configured by a Host system. 						'00' P2P Connection 						'01' Ring Connection 						'10' HUB Connection 						'11' HUB is connected in Ring 						" range="23 - 22" rwaccess="R"/> 
		<bitfield id="CORECFG_UHS2_MAX_DEVICES" width="4" begin="21" end="18" resetval="0x1" description="This field indicates the maximum number of devices supported by the Host Controller. 									0h - Not used 									1h - 1 Devices 									2h - 2 Devices 									..... 									....... 									Fh - 15 Devices  						" range="21 - 18" rwaccess="R"/> 
		<bitfield id="DEVICE_TYPE" width="2" begin="17" end="16" resetval="0x0" description="This field indicates device type configured by a Host system. 						'00' Removable Card[P2P] 						'01' Embedded Devices 						'10' Embedded Devices+Removable Card 						'11' Reserved 						" range="17 - 16" rwaccess="R"/> 
		<bitfield id="CFG_64BIT_ADDRESSING" width="1" begin="14" end="14" resetval="0x1" description="This field indicates support of 64-bit addressing by the Host Controller. 						'0' 32-bit Addressing is supported 						'1' 32-bit and 64-bit Addressing is supported 						" range="14" rwaccess="R"/> 
		<bitfield id="NUM_LANES" width="6" begin="13" end="8" resetval="0x15" description="This field indicates support of lanes by the Host Controller.0 mean not supported and 1 means supported. 									D08 - 2L-HD 									D09 - 2D1U-FD 									D10 - 1D2U-FD 									D11 - 2D2U-FD 									D12 - Reserved 									D13 - Reserved  						" range="13 - 8" rwaccess="R"/> 
		<bitfield id="GAP" width="4" begin="7" end="4" resetval="0x1" description="This field indicates the maximum capability of host power supply for a group configured by a Host system.This field is used to set the argument of DEVICE_INIT CCMD 									0h -Not used 									1h - 360 mW 									2h - 720 mW 									..... 									....... 									Fh - 360x15 mW 						" range="7 - 4" rwaccess="R"/> 
		<bitfield id="DAP" width="4" begin="3" end="0" resetval="0x1" description="This field indicates the maximum capability of host power supply for a device configured by a Host system.This field is used to set the argument of DEVICE_INIT CCMD 									0h -360 mW [Default] 									1h - 360 mW 									2h - 720 mW 									..... 									....... 									Fh - 360 x15 mW 						" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_phy_cap" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_phy_cap" offset="0x114" width="32" description="Start Address of PHY Capabilities is pointed by Pointer for UHS-II Host Capabilities Register.
					">
		<bitfield id="N_LSS_DIR" width="4" begin="23" end="20" resetval="0x1" description=" 						This field indicates the minimum N_LSS_DIR required by the Host Controller. 									0h - 4 x16 LSS 									1h - 4 x 1 LSS 									2h - 4 x 2 LSS 									3h - 4 x 3 LSS 									...... 									...... 									Fh - 4 x 15 LSS 						 " range="23 - 20" rwaccess="R"/> 
		<bitfield id="N_LSS_SYN" width="4" begin="19" end="16" resetval="0x1" description="This field indicates the minimum N_LSS_SYN required by the Host Controller. 									0h - 4 x16 LSS 									1h - 4 x 1 LSS 									2h - 4 x 2 LSS 									3h - 4 x 3 LSS 									...... 									...... 									Fh - 4 x 15 LSS  						" range="19 - 16" rwaccess="R"/> 
		<bitfield id="SPEED_RANGE" width="2" begin="7" end="6" resetval="0x0" description="This field indicates supported Speed Range by the Host Controller 						'00' Range A [Default] 						'01' Range A and Range B 						'10' Reserved 						'11' Reserved 						" range="7 - 6" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_lnk_trn_cap" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_uhs2_lnk_trn_cap" offset="0x118" width="64" description="Start Address of LINK/TRAN settings is pointed by Pointer for UHS-II Capabilities Register.
					">
		<bitfield id="N_DATA_GAP" width="8" begin="39" end="32" resetval="0x129" description="This field indicates the minimum number of data gap[DIDL] supported by the Host Controller.	 										00h - No Gap 										01h - 1 LSS 										02h - 2 LSS 										03h - 3 LSS 										...... 										...... 										FFh - 255 LSS 					     " range="39 - 32" rwaccess="R"/> 
		<bitfield id="MAX_BLK_LENGTH" width="12" begin="31" end="20" resetval="0x512" description="This field indicates maximum block length by the Host Controller. 									000h - Not Used 									001h - 1 byte 									002h - 2 bytes 									...... 									...... 									200h - 512 bytes 									...... 									...... 									800h - 2048 bytes 									801h-FFFh -Not Used  						" range="31 - 20" rwaccess="R"/> 
		<bitfield id="N_FCU" width="8" begin="15" end="8" resetval="0x1" description=" 						This field indicates maximum the number of blocks in a Flow Control unit by the Host Controller.This value is determined by supported buffer size. 								00h - 256 Blocks 								01h - 1 Block 								02h - 2 Block 								03h - 3 Block 								....... 								FFh - 255 Blocks 						" range="15 - 8" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_force_UHSII_Err_Int_Sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_force_UHSII_Err_Int_Sts" offset="0x120" width="32" description="This register is not physically implemented, rather it is an address where UHS-II Error Interrupt Status register can be written.
					">
		<bitfield id="VENDOR_SPECIFIC" width="5" begin="31" end="27" resetval="0x0" description="Force Event for Vendor Specific Error 									 0h - Not Affected 									 1h - Vendor Specific Error Status is set 						" range="31 - 27" rwaccess="W"/> 
		<bitfield id="TIMEOUT_DEADLOCK" width="1" begin="17" end="17" resetval="0x0" description="Setting this bit forces the Host Controller to set Timeout for Deadlock in the UHS-II Error Interrupt Status register. 						" range="17" rwaccess="W"/> 
		<bitfield id="TIMEOUT_CMD_RES" width="1" begin="16" end="16" resetval="0x0" description="Setting this bit forces the Host Controller to set Timeout for CMD_RES in the UHS-II Error Interrupt Status register. 						" range="16" rwaccess="W"/> 
		<bitfield id="ADMA" width="1" begin="15" end="15" resetval="0x0" description="Setting this bit forces the Host Controller to set ADMA Error in the UHS-II Error Interrupt Status register. 						" range="15" rwaccess="W"/> 
		<bitfield id="EBSY" width="1" begin="8" end="8" resetval="0x0" description="Setting this bit forces the Host Controller to set EBSY Error in the UHS-II Error Interrupt Status register. 						" range="8" rwaccess="W"/> 
		<bitfield id="UNRECOVERABLE" width="1" begin="7" end="7" resetval="0x0" description="Setting this bit forces the Host Controller to set Unrecover-able Error in the UHS-II Error Interrupt Status register. 						" range="7" rwaccess="W"/> 
		<bitfield id="TID" width="1" begin="5" end="5" resetval="0x0" description="Setting this bit forces the Host Controller to set TID Error in the UHS-II Error Interrupt Status register. 						" range="5" rwaccess="W"/> 
		<bitfield id="FRAMING" width="1" begin="4" end="4" resetval="0x0" description="Setting this bit forces the Host Controller to set Framing Error in the UHS-II Error Interrupt Status register. 						" range="4" rwaccess="W"/> 
		<bitfield id="CRC" width="1" begin="3" end="3" resetval="0x0" description="Setting this bit forces the Host Controller to set CRC Error in the UHS-II Error Interrupt Status register. 						" range="3" rwaccess="W"/> 
		<bitfield id="RETRY_EXPIRED" width="1" begin="2" end="2" resetval="0x0" description="Setting this bit forces the Host Controller to set Retry Expired in the UHS-II Error Interrupt Status register. 						" range="2" rwaccess="W"/> 
		<bitfield id="RES_PKT" width="1" begin="1" end="1" resetval="0x0" description="Setting this bit forces the Host Controller to set RES Packet Error in the UHS-II Error Interrupt Status register. 						" range="1" rwaccess="W"/> 
		<bitfield id="HEADER" width="1" begin="0" end="0" resetval="0x0" description="Setting this bit forces the Host Controller to set Header Error in the UHS-II Error Interrupt Status register. 						" range="0" rwaccess="W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_version" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_version" offset="0x200" width="32" description="This register provides information about the version of the eMMC CQ standard which is 285 implemented by the CQE, in BCD format. The current version is rev 5.1
							    The following table describes the CQBASE+00h: CQVReservedER   Command Queueing Version.
					">
		<bitfield id="EMMC_MAJOR_VER_NUM" width="4" begin="11" end="8" resetval="0x5" description=" 						eMMC Major Version Number [digit left of decimal point],in BCD format 						" range="11 - 8" rwaccess="R"/> 
		<bitfield id="EMMC_MINOR_VER_NUM" width="4" begin="7" end="4" resetval="0x1" description=" 						eMMC Minor Version Number [digit right of decimal point], in BCD format 						" range="7 - 4" rwaccess="R"/> 
		<bitfield id="EMMC_VERSION_SUFFIX" width="4" begin="3" end="0" resetval="0x0" description=" 						eMMC Version Suffix [2nd digit right of decimal point], in BCD format 						" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_capabilities" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_capabilities" offset="0x204" width="32" description="This register is reserved for capability indication.
					">
		<bitfield id="CF_MUL" width="4" begin="15" end="12" resetval="0x3" description=" 						Internal Timer Clock Frequency Multiplier [ITCFMUL] ITCFMUL and ITCFVAL indicate the frequency of the clock used for interrupt coalescing timer and for deter-mining the SQS polling period. 						     See ITCFVAL definition 						for details. 						Field Value Description: 						0h = 0.001 MHz 						1h = 0.01 MHz 						2h = 0.1 MHz 						3h = 1 MHz 						4h = 10 MHz 						Other values are reserved 						" range="15 - 12" rwaccess="R"/> 
		<bitfield id="CF_VAL" width="10" begin="9" end="0" resetval="0x200" description=" 						Internal Timer Clock Frequency Value [ITCFVAL] 						TCFMUL and ITCFVAL indicate the frequency of the clock used for interrupt coalescing timer and for deter-mining the polling period when using periodic 						SEND_QUEUE_ STATUS [CMD13] polling. 						The clock frequency is calculated as ITCFVAL*ITCFMUL. 						For example, to encode 19.2 MHz ITCFVAL shall be C0h [= 192 decimal] and ITCFMUL shall be 2h [0.1 MHz 192 * 0.1 MHz 19.2 MHz] 						" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_config" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_config" offset="0x208" width="32" description="This register controls CQE behavior affecting the general operation of command queueing 290 module or operation of multiple tasks in the same time.
					">
		<bitfield id="DCMD_ENA" width="1" begin="12" end="12" resetval="0x0" description=" 						Direct Command [DCMD] Enable This bit indicates to the hardware whether the Task Descriptor in slot #31 of the TDL is a Data Transfer Task Descriptor, or a Direct Command Task Descriptor. 						CQE uses this bit when a task is issued in slot #31, to determine how to decode the Task Descriptor. 						Bit Value Description 						1 = Task descriptor in slot #31 is a DCMD Task Descrip-tor 						0 = Task descriptor in slot #31 is a Data Transfer Task Descriptor 						" range="12" rwaccess="R/W"/> 
		<bitfield id="TASK_DESC_SIZE" width="1" begin="8" end="8" resetval="0x0" description=" 						Task Descriptor Size This bit indicates whether the task descriptor size is 128 bits or 64 bits as detailed in Data Structures section. This bit can only be configured when Command Queueing 						Enable bit is 0 [command queueing is disabled] Bit Value Description 						1 = Task descriptor size is 128 bits 						0 = Task descriptor size is 64 bits 						" range="8" rwaccess="R/W"/> 
		<bitfield id="CQ_ENABLE" width="1" begin="0" end="0" resetval="0x0" description=" 						Command Queueing Enable Software shall write 1 this bit when in order to enable command queueing mode [i.e. enable CQE]. 						When this bit is 0, CQE is disabled and software controls the eMMC bus using the legacy eMMC host controller. 						Before software writes 1 to this bit, software shall verify that the eMMC host controller is in idle state and there are no commands or data transfers ongoing. 						When software wants to exit command queueing mode,it shall clear all previous tasks if such exist before setting this bit to 0. 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_control" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_control" offset="0x20C" width="32" description="This register controls CQE behavior affecting the general operation of command queueing 293 module or operation of multiple tasks in the same time.
					">
		<bitfield id="CLEAR_ALL_TASKS" width="1" begin="8" end="8" resetval="0x0" description=" 						Clear All Tasks Software shall write 1 this bit when it wants to clear all the tasks sent to the device. 						This bit can only be written when CQE is in halt state [i.e.Halt bit is 1]. 						When software writes 1, the value of the register is updated to 1, and CQE shall reset CQTDBR register and all other context information for all unfinished tasks. 						Then CQE will clear this bit.Software should poll on this bit until it is set to back 0 and may then resume normal operation, by clearing the Halt bit. 						CQE does not communicate to the device that the tasks were cleared. It is softwares responsibility to order the device to discard the tasks in its queue using CMDQ_TASK_MGMT command. 						Writing 0 to this register shall have no effect. 						" range="8" rwaccess="R/W"/> 
		<bitfield id="HALT_BIT" width="1" begin="0" end="0" resetval="0x0" description=" 						Halt Host software shall write 1 to the bit when it wants to acquire software control over the eMMC bus and disable CQE from issuing commands on the bus. 						For example, issuing a Discard Task command [CMDQ_TASK_MGMT] When software writes 1, CQE shall complete the ongo-ing task if such a task is in progress. 						Once the task is completed and CQE is in idle state,CQE shall not issue new commands and shall indicate so to software by setting this bit to 1. 						Software may poll on this bit until it is set to 1, and may only then send commands on the eMMC bus. 						In order to exit halt state [i.e. resume CQE activity], soft-ware shall clear this bit [write 0]. Writing 0 when thevalue is already 0 shall have no effect. 						" range="0" rwaccess="R/W"/>
	</register>
