ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sts" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sts" offset="0x210" width="32" description="This register indicates pending interrupts that require service. Each bit in this registers is asserted 296 in response a specific event, only if the respective bit is set in CQ								 ISTE register.
					">
		<bitfield id="TASK_ERROR" width="1" begin="4" end="4" resetval="0x0" description=" 						Task Error Interrupt [TERR] This bit is asserted when task error is detected due to invalid task descriptor 						" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="TASK_CLEARED" width="1" begin="3" end="3" resetval="0x0" description=" 						Task Cleared [TCL] This status bit is asserted [if CQISTE.TCL=1] when a task clear operation is completed by CQE. The com-pleted task clear operation is either an individual task 						clear [CQTCLR] or clearing of all tasks [CQCTL]. 						" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="RESP_ERR_DET" width="1" begin="2" end="2" resetval="0x0" description=" 						Response Error Detected Interrupt [RED] This status bit is asserted [if CQISTE.RED=1] when a response is received with an error bit set in the device 						status field. The contents of the device status field are listed in Section 6.13.Software uses CQRMEM register to configure which device status bit fields may trigger an interrupt, and 						which are masked. 						" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="TASK_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description=" 						Task Complete Interrupt [TCC] This status bit is asserted [if CQISTE.TCC=1] when atleast one of the following two conditions are met: 						[1] A task is completed and the INT bit is set in its Task Descriptor 						[2] Interrupt caused by Interrupt Coalescing logic [see Section C.4.9] 						" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="HALT_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description=" 						Halt Complete Interrupt [HAC] This status bit is asserted [if CQISTE.HAC=1] when halt bit in CQCTL register transitions from 0 to 1 indicating 						that host controller has completed its current ongoing task and has entered halt state. 						" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sts_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sts_ena" offset="0x214" width="32" description="This register enables and disables the reporting of the corresponding interrupt to host soft-ware in 299 CQIS register. When a bit is set ( 1 ) and the corresponding interrupt c								-ondition is active, then the 300 bit is CQIS is asserted. Interrupt sources that are disabled ( 0 ) are not
							    indicated in the CQIS 301 register. This register is bit-index matched to CQIS register.
					">
		<bitfield id="TASK_ERROR" width="1" begin="4" end="4" resetval="0x0" description=" 						Task Error Interrupt Status Enable 						1 = CQIS.TERR will be set when its interrupt condition is active 						0 = CQIS.TERR is disabled 						" range="4" rwaccess="R/W"/> 
		<bitfield id="TASK_CLEARED" width="1" begin="3" end="3" resetval="0x0" description=" 						Task Cleared Status Enable [TCL] 						1 = CQIS.TCL will be set when its interrupt condition is active 						0 = CQIS.TCL is disabled 						" range="3" rwaccess="R/W"/> 
		<bitfield id="RESP_ERR_DET" width="1" begin="2" end="2" resetval="0x0" description=" 						Response Error Detected Status Enable [RED] 						1 = CQIS.RED will be set when its interrupt condition is active 						0 = CQIS.RED is disabled 						" range="2" rwaccess="R/W"/> 
		<bitfield id="TASK_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description=" 						Task Complete Status Enable [TCC] 						1 = CQIS.TCC will be set when its interrupt condition is active 						0 = CQIS.TCC is disabled 						" range="1" rwaccess="R/W"/> 
		<bitfield id="HALT_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description=" 						Halt Complete Status Enable [HAC]  						1 = CQIS.HAC will be set when its interrupt condition is active 						0 = CQIS.HAC is disabled 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sig_ena" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_sig_ena" offset="0x218" width="32" description="This register enables and disables the generation of interrupts to host software. When a bit is set 304 ( 1 ) and the corresponding bit in CQIS is set, then an interrupt is gene								 -rated. Interrupt sources 305 that are disabled ( 0 ) are still indicated in the CQIS register. This register is bit-index matched 306 to CQIS register.
					">
		<bitfield id="TASK_ERROR" width="1" begin="4" end="4" resetval="0x0" description=" 						Task Error Interrupt Signal Enable [TERR] 						When set and CQIS.TERR is asserted, the CQE shall generate an interrupt 						" range="4" rwaccess="R/W"/> 
		<bitfield id="TASK_CLEARED" width="1" begin="3" end="3" resetval="0x0" description=" 						Task Cleared Signal Enable [TCL] 						When set and CQIS.TCL is asserted, the CQE shall generate an interrupt 						" range="3" rwaccess="R/W"/> 
		<bitfield id="RESP_ERR_DET" width="1" begin="2" end="2" resetval="0x0" description=" 						Response Error Detected Signal Enable [TCC] 						When set and CQIS.RED is asserted, the CQE shall generate an interrupt 						" range="2" rwaccess="R/W"/> 
		<bitfield id="TASK_COMPLETE" width="1" begin="1" end="1" resetval="0x0" description=" 						Task Complete Signal Enable [TCC] 						When set and CQIS.TCC is asserted, the CQE shall generate an interrupt 						" range="1" rwaccess="R/W"/> 
		<bitfield id="HALT_COMPLETE" width="1" begin="0" end="0" resetval="0x0" description=" 						Halt Complete Signal Enable [HAC] 						When set and CQIS.HAC is asserted, the CQE shall generate an interrupt 						" range="0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_coalescing" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_intr_coalescing" offset="0x21C" width="32" description="This register controls the interrupt coalescing feature.
					">
		<bitfield id="CQINTCOALESC_ENABLE" width="1" begin="31" end="31" resetval="0x0" description=" 						When set to 0 by software, command responses are neither counted nor timed. Interrupts are still triggered by completion of tasks with INT=1 in the Task Descriptor. 						When set to 1, the interrupt coalescing mechanism is enabled and coalesced interrupts are generated. 						" range="31" rwaccess="R/W"/> 
		<bitfield id="IC_STATUS" width="1" begin="20" end="20" resetval="0x0" description=" 						This bit indicates to software whether any tasks [with INT=0] have completed and counted towards interrupt coalescing [i.e., ICSB is set if and only if IC counter > 0]. 						Bit Value Description 1 = At least one task completion has been counted [IC counter >0] 						0 = No task completions have occurred since last counter reset [IC counter =0] 						" range="20" rwaccess="R"/> 
		<bitfield id="CTR_THRESHOLD" width="5" begin="12" end="8" resetval="0x0" description=" 						Interrupt Coalescing Counter Threshold [ICCTH]: 						Software uses this field to configure the number of task completions [only tasks with INT=0 in the Task Descriptor] which are required in order to generate an interrupt. 						Counter Operation: As data transfer tasks with INT=0 complete, they are counted by CQE. The counter is reset by software during the interrupt service routine. 						The counter stops counting when it reaches the value configured in ICCTH. 						The maximum allowed value is 31 						NOTE : When ICCTH is 0, task completions are not counted, and counting-based interrupts are not generated.In order to write to this field, the ICCTHWEN bit must be 						set at the same write operation. 						" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="TIMEOUT_VAL" width="7" begin="6" end="0" resetval="0x0" description=" 						Interrupt Coalescing Timeout Value [ICTOVAL]: 						Software uses this field to configure the maximum time allowed between the completion of a task on the bus and the generation of an interrupt. 						Timer Operation: The timer is reset by software during the interrupt service routine. 						It starts running when a data transfer task with INT=0 is completed, after the timer was reset. When the timer 						reaches the value configured in ICTOVAL field it generates an interrupt and stops. 						The timers unit is equal to 1024 clock periods of the clock whose frequency is specified in the Internal Timer 						Clock Frequency field CQCAP register.The minimum value is 01h [1024 clock periods] and the maximum value is 7Fh [127*1024 clock periods]. 						For example, a CQCAP field value of 0 indicates a 19.2 MHz clock frequency [period = 52.08 ns]. If the setting in ICTOVAL is 10h, the calculated polling period is 						16*1024*52.08 ns= 853.33 us 						NOTE: When ICTOVAL is 0, the timer is not running, and timer-based interrupts are not generated. 						In order to write to this field, the ICTOVALWEN bit must be set at the same write operation. 						" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_tdl_base_addr" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_tdl_base_addr" offset="0x220" width="32" description="This register is used for configuring the lower 32 bits of the byte address of the head of the Task 312 Descriptor List in the host memory.
					">
		<bitfield id="CQTDLBA_LO" width="32" begin="31" end="0" resetval="0x0" description=" 						Task Descriptor List Base Address [TDLBA] 						This register stores the LSB bits [bits 31:0] of the byte address of the head of the Task Descriptor List in system memory. 						The size of the task descriptor list is 32 * [Task Descrip-tor size + Transfer Descriptor size] as configured by Host driver. 						This address shall be set on Byte1 KByte boundary.: The lower 10 bits of this register shall be set to 0 by software and shall be ignored by CQE. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_tdl_base_addr_upbits" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_tdl_base_addr_upbits" offset="0x224" width="32" description="This register is used for configuring the upper 32 bits of the byte address of the head of the Task 316 Descriptor List in the host memory.
					">
		<bitfield id="CQTDLBA_HI" width="32" begin="31" end="0" resetval="0x0" description=" 						Task Descriptor List Base Address [TDLBA] 						This register stores the MSB bits [bits 63:32] of the byte address of the head of the Task Descriptor List in system memory. 						The size of the task descriptor list is 32 * [Task Descrip-tor size + Transfer Descriptor size] as configured by Host driver. 						This register is reserved when using 32-bit addressing mode. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_door_bell" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_door_bell" offset="0x228" width="32" description="Using this register, software triggers CQE to process a new task.
					">
		<bitfield id="CQTDB_VAL" width="32" begin="31" end="0" resetval="0x0" description=" 						Command Queueing Task Doorbell Software shall configure TDLBA and TDLBAU, and enable CQE in CQCFG before using this register. 						Writing 1 to bit n of this register triggers CQE to start pro-cessing the task encoded in slot n of the TDL. 						CQE always processes tasks in-order according to the order submitted to the list by CQTDBR write transac-tions. 						CQE processes Data Transfer tasks by reading the Task Descriptor and sending QUEUED_TASK_PARAMS[CMD44] and QUEUED_TASK_ADDRESS [CMD45]commands to the device. 						CQE processes DCMD tasks [in slot #31, when enabled]by reading the Task Descriptor, and generating the com-mand encoded by its index and argument. 						The corresponding bit is cleared to 0 by CQE in one of the following events: 						[a] When a task execution is completed [with success or error] 						[b] The task is cleared using CQTCLR register 						[c] All tasks are cleared using CQCTL register 						[d] CQE is disabled using CQCFG register 						Software may initiate multiple tasks at the same time [batch submission] by writing 1 to multiple bits of this register in the same transaction. 						In the case of batch submission: 						CQE shall process the tasks in order of the task index,starting with the lowest index. 						If one or more tasks in the batch are marked with QBR,the ordering of execution will be based on said process-ing order. 						Writing 0 by software shall have no impact on the hard-ware, and will not change the value of the register bit. 						" range="31 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_comp_notif" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_comp_notif" offset="0x22C" width="32" description="This register is used by CQE to notify software about completed tasks.
					">
		<bitfield id="CQTCN_VAL" width="32" begin="31" end="0" resetval="0x0" description="CQE shall set bit n of this register [at the same time it clears bit n of CQTDBR] when a task execution is com-pleted [with success or error]. When receiving interrupt for task completion, software may read this register to know which tasks have finished. After reading this register, software may clear the rele-vant bit fields by writing 1 to the corresponding bits. 						" range="31 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dev_queue_status" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dev_queue_status" offset="0x230" width="32" description="This register stores the most recent value of the device s queue status.
					">
		<bitfield id="CQDQ_STS" width="32" begin="31" end="0" resetval="0x0" description="Every time the Host controller receives a queue status register [QSR] from the device, it updates this register with the response of status command, i.e. the devices queue status. 						" range="31 - 0" rwaccess="R"/>
	</register>
