ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MMCSD0_CTL_CFG.xml
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dev_pending_tasks" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dev_pending_tasks" offset="0x234" width="32" description="This register indicates to software which tasks are queued in the device, awaiting execution.
					">
		<bitfield id="CQDP_TSKS" width="32" begin="31" end="0" resetval="0x0" description="Bit n of this register is set if and only if QUEUED_TASK_PARAMS [CMD44] and QUEUED_TASK_ADDRESS [CMD45] were sent for this specific task and if this task hasnt been executed yet.CQE shall set this bit after receiving a successful response for CMD45. CQE shall clear this bit after the task has completed execution.Software needs to read this register in the task-discard procedure, when the controller is halted, to determine if the task is queued in the device. If the task is queued,the driver sends a CMDQ_TASK_MGMT [CMD48] to the device ordering it to discard the task. Then software clears the task in the CQE. Only then the software orders CQE to resume its operation using CQCTL register. 						" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_clear" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_clear" offset="0x238" width="32" description="This register is used for removing an outstanding task in the CQE. 327. The register should be used only when CQE is in Halt state.
					">
		<bitfield id="CQTCLR" width="32" begin="31" end="0" resetval="0x0" description="Writing 1 to bit n of this register orders CQE to clear a task which software has previously issued.This bit can only be written when CQE is in Halt state as            indicated in CQCFG register Halt bit.When software writes 1 to a bit in this register,CQE updates the value to 1, and starts clearing the data structures related to the task. CQE clears the bit fields                                 [sets a value of 0] in CQTCLR and in CQTDBR once clear operation is complete.Software should poll on the CQTCLR until it is cleared to verify clear operation was complete.Writing to this register only clears the task in the CQE and does not have impact on the device. In order to dis-card the task in the device, host software shall send CMDQ_TASK _MGMT while CQE is still in Halt state.Host driver is not allowed to use this register to clear multiple tasks at the same time. Clearing multiple tasks can be done using CQCTL register.Writing 0 to a register bit shall have no impact. 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_send_sts_config1" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_send_sts_config1" offset="0x240" width="32" description="The register controls the when SEND_QUEUE_STATUS commands are sent.
					">
		<bitfield id="CMD_BLK_CNTR" width="4" begin="19" end="16" resetval="0x1" description="This field indicates to CQE when to send SEND_QUEUE_STATUS [CMD13] command to inquire the status of the devices task queue.A value of n means CQE shall send status command on the CMD line, during the transfer of data block BLOCK_CNT-n, on the data lines, where BLOCK_CNT is the number of blocks in the current transaction.A value of 0 means that SEND_QUEUE_STATUS [CMD13] command shall not be sent during the transac-tion. Instead it will be sent only when the data lines are idle.A value of 1 means that STATUS command is to be sent during the last block of the transaction. 						" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="CMD_IDLE_TIMER" width="16" begin="15" end="0" resetval="0x4096" description="This field indicates to CQE the polling period to use when using periodic SEND_QUEUE_STATUS [CMD13] polling.Periodic polling is used when tasks are pending in the device, but no data transfer is in progress. When a SEND_QUEUE_STATUS response indicating that no task is ready for execution, CQE counts the configured time until it issues the next SEND_QUEUE_STATUS.Timer units are clock periods of theclock whose fre-quency is specified in the Internal Timer Clock Fre-quency field CQCAP register.The minimum value is 0001h [1 clock period] and the maximum value is FFFFh [65535 clock periods]. Default interval is: 4096 clock periods. For example, a CQCAP field value of 0 indicates a 19.2 MHz clock frequency [period = 52.08 ns]. If the setting in CQSST is 1000h, the calcu.lated polling period is 4096*52.08 ns= 213.33 us. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_send_sts_config2" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_send_sts_config2" offset="0x244" width="32" description="This register is used for 333 configuring RCA field in SEND_QUEUE_STATUS command argu-ment.
					">
		<bitfield id="QUEUE_RCA" width="16" begin="15" end="0" resetval="0x0" description="This field provides CQE with the contents of the 16-bit RCA field in SEND_QUEUE_ STATUS [CMD13] com-mand. argument. CQE shall copy this field to bits 31:16 of the argument when transmitting SEND_ QUEUE_STATUS [CMD13] command. 						" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dcmd_response" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_dcmd_response" offset="0x248" width="32" description="This register is used for passing the response of a DCMD task to software.
					">
		<bitfield id="LAST_RESP" width="32" begin="31" end="0" resetval="0x0" description="This register contains the response of the command generated by the last direct-command [DCMD] task which was sent.CQE shall update this register when it receives the response for a DCMD task. This register is considered valid only after bit 31 of CQT-DBR register is cleared by CQE. 						" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_resp_err_mask" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_resp_err_mask" offset="0x250" width="32" description="This register controls the generation of Response Error Detection (RED) interrupt.
					">
		<bitfield id="CQRMEM" width="32" begin="31" end="0" resetval="0x4260995200" description="This bit is used as in interrupt mask on the device status filed which is received in R1/R1b responses.Bit Value Description [for any bit i]:1 = When a R1/R1b response is received, with bit i in the device status set, a RED interrupt is generated 0 = When a R1/R1b response is received, bit i in the device status is ignored The reset value of this register is set to trigger an inter-rupt on all Error type bits in the device status, as defined in Section 6.13.NOTE: Responses to CMD13 [SQS] encode the QSR,so they are ignored by this logic 						" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_err_info" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_task_err_info" offset="0x254" width="32" description="This register is updated by CQE when an error occurs on data or command related to a task activity. 
					When such error is detected by CQE or indicated by the eMMC controller CQE stores in CQTERRI the task IDs and the command indices of the commands which were executed on
					the 343 command line and data lines when the error occurred.Software is expected to use this information in the error recovery procedure. 
					">
		<bitfield id="DATERR_VALID" width="1" begin="31" end="31" resetval="0x0" description=" 						Data Transfer Error Fields Valid 						This bit is updated when an error is detected by CQE, or indicated by eMMC controller. 						If a data transfer is in progress when the error is detected/indicated, the bit is set to 1. 						If a no data transfer is in progress when the error is detected/indicated, the bit is cleared to 0. 						" range="31" rwaccess="R"/> 
		<bitfield id="DATERR_TASK_ID" width="5" begin="28" end="24" resetval="0x0" description=" 						Data Transfer Error Task ID 						This field indicates the ID of the task which was executed on the data lines when an error occurred. 						The field is updated if a data transfer is in progress when an error is detected by CQE, or indicated by eMMC controller 						" range="28 - 24" rwaccess="R"/> 
		<bitfield id="DATERR_CMD_INDEX" width="6" begin="21" end="16" resetval="0x0" description=" 						Data Transfer Error Command Index 						This field indicates the index of the command which was executed on the data lines when an error occurred. 						The index shall be set to EXECUTE_READ_TASK[CMD46] or EXECUTE_WRITE_TASK [CMD47] accord-ing to the data direction. 						The field is updated if a data transfer is in progress when an error is detected by CQE, or indicated by eMMC controller. 						" range="21 - 16" rwaccess="R"/> 
		<bitfield id="RESP_MODE_VALID" width="1" begin="15" end="15" resetval="0x0" description=" 						Response Mode Error Fields Valid 						This bit is updated when an error is detected by CQE, or indicated by eMMC controller. 						If a command transaction is in progress when the error is detected/indicated, the bit is set to 1. 						If a no command transaction is in progress when the error is detected/indicated, the bit is cleared to 0. 						" range="15" rwaccess="R"/> 
		<bitfield id="RESP_MODE_TASK_ID" width="5" begin="12" end="8" resetval="0x0" description=" 						Response Mode Error Task ID 						This field indicates the ID of the task which was executed on the command line when an error occurred. 						The field is updated if a command transaction is in progress when an error is detected by CQE, or indicated by eMMC controller. 						" range="12 - 8" rwaccess="R"/> 
		<bitfield id="RESP_MODE_CMD_INDEX" width="6" begin="5" end="0" resetval="0x0" description=" 						Response Mode Error Command Index 						This field indicates the index of the command which was executed on the command line when an error occurred. 						The field is updated if a command transaction is in progress when an error is detected by CQE, or indicated by eMMC controller. 						" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_cmd_resp_index" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_cmd_resp_index" offset="0x258" width="32" description="This register stores the index of the last received command response.
					">
		<bitfield id="LAST_CRI" width="6" begin="5" end="0" resetval="0x0" description="This field stores the index of the last received command response. CQE shall update the value every time a com-mand response is received. 						" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_cmd_resp_arg" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_cmd_resp_arg" offset="0x25C" width="32" description="This register stores the index of the last received command response.
					">
		<bitfield id="LAST_CRA" width="32" begin="31" end="0" resetval="0x0" description="This field stores the argument of the last received com-mand. CQE shall update the value every time a com-mand response is received. 						" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="SDHC_WRAP__CTL_CFG__CTLCFG_cq_error_task_id" acronym="SDHC_WRAP__CTL_CFG__CTLCFG_cq_error_task_id" offset="0x260" width="32" description="CQ Error Task ID Register
					">
		<bitfield id="TERR_ID" width="5" begin="4" end="0" resetval="0x0" description="Task Error ID 						" range="4 - 0" rwaccess="R"/>
	</register>
</module>